{
  "timeline_id": "0cac13e357",
  "posts": [
    {
      "post_index": 1,
      "post_id": "8f240451e8",
      "date": "02-09-2019, 01:45:02",
      "post": "I'm mean",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "751ec3360a",
      "date": "05-09-2019, 05:12:27",
      "post": "[HELP!] Calling All Animal Fosters from around the Orange County area!\nI am in desperate need of some help right now.      I have recently found a bundle of 7 or so kittens hanging around a dangerous abandoned lot with ages ranging from 2 to 7 months.   Since finding them, I have started to feed and water them in the hopes that one of them will trust me enough to get close to me. My initial plan was TNR but, due to the fact that they're young, I want them to have a better future in a home with a loving family.      I unfortunately cannot be that person since the place I live in right now does not allow animals and I am not staying in California forever. I've tried contacting different TNR and foster programs for some help or assistance during the matter but most places are already full or have too many projects to take care of.  I'm a poor college girl but I want to try my best to get these cats a better life out of that lot...  Would anyone be willing to help me or give me some advice on what to do? I'm desperate.",
      "Post Summary": "The dominant self-state in the post is an adaptive one, centered on the desire to help the kittens secure a better future by addressing their needs. This is accompanied by her perception of herself actively supporting them and engaging in helpful behaviors. Additionally, she expresses hope that someone or an organization will step in to assist.\r\n\r\nThe maladaptive self-state, however, is reflected in her expression of desperation and heightened tension about the situation, emphasizing her urgent need for help.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(5) Content, happy, joy, hopeful",
            "highlighted_evidence": "hopes that one of them will trust me enough to get close to me"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I've tried contacting different TNR and foster programs for some help or assistance"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I'm a poor college girl but I want to try my best to get these cats a better life out of that lot."
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "Would anyone be willing to help me or give me some advice on what to do?"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I am in desperate need of some help right now."
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "b08cd9e3f2",
      "date": "09-09-2019, 21:18:38",
      "post": "Are there any Orange County cat foster homes that are willing to help find these babies a home? Please?",
      "Post Summary": "The adaptive self-state present here centers on the desire to guide the kittens toward a better future while seeking support to achieve this goal. The maladaptive self-state addresses the same concern but is marked by tension and stress surrounding the subject.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "are willing to help find these babies a home"
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "Are there any Orange County cat foster homes that are willing to help find these babies a home?"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "Please"
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "a7f3e65bd7",
      "date": "11-09-2019, 21:11:33",
      "post": "I found these 7 cats near an abandoned lot and I haven't had much success in getting TNR specialists to help me out with trapping them. Are there any TNR specialists to help me out with them?",
      "Post Summary": "In this post, there appears to be a shift in the self-states, with the maladaptive self-state becoming more prominent while the adaptive self-state weakens slightly.\r\n\r\nThe maladaptive self-state includes subtle self-criticism for not successfully achieving her goals for the kittens, along with a perception of others as unhelpful.\r\n\r\nThe adaptive self-state focuses on the hope that someone will eventually step in to assist and help resolve the situation.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "Are there any TNR specialists to help me out with them?"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I haven't had much success"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I haven't had much success in getting TNR specialists to help me out"
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "6d0de5af51",
      "date": "02-10-2019, 21:18:26",
      "post": "When the doctors said that my pills would make my depression worse... they weren't kidding\nI feel like the world, as of now, is full of nothing but drama and lies and cheats. I have nothing ahead of me. I have one more year left of college and then what? Struggling financially until the world caves in on itself?  Will everyone I meet just be manipulative attention seekers and only take advantage of the kindness or interest I've showed them?   I have nothing to look forward to; I have no opportunities in business and in love. Why do I even try.  Maybe I'm better off living alone.",
      "Post Summary": "he dominant self-state is maladaptive, characterized by feelings of hopelessness and depression. She perceives others as manipulative and exploiting her kindness.\r\n\r\nIn contrast, the subtle adaptive self-state involves trusting the doctors’ honesty about the effects of the pills, showing self-compassion, and viewing herself as kind and genuinely interested in others.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "the kindness or interest I've showed them"
          },
          "C-O": {
            "Category": "(3) Perception of the other as facilitating autonomy needs",
            "highlighted_evidence": "When the doctors said that my pills would make my depression worse... they weren't kidding"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I have nothing to look forward to; I have no opportunities in business and in love. Why do I even try.  Maybe I'm better off living alone."
          },
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "Will everyone I meet just be manipulative attention seekers and only take advantage of the kindness or interest I've showed them?"
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "ffb2e46acf",
      "date": "09-10-2019, 16:03:37",
      "post": "My sister caught my son mid yawn. This never fails to make me laugh",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 7,
      "post_id": "1b9826cf0a",
      "date": "21-10-2019, 18:38:25",
      "post": "This lowkey became viral in my work group so I thought I'd share it here",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 8,
      "post_id": "aa43c43298",
      "date": "31-10-2019, 23:12:28",
      "post": "You could say my sister is strange and unusual",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 9,
      "post_id": "0649896878",
      "date": "31-10-2019, 23:20:30",
      "post": "[Photographer] my sister is strange and unusual this Halloween",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    }
  ],
  "timeline_summary": "The self-states in this timeline fluctuate between adaptive and maladaptive both within individual posts and across different posts. In some posts, both voices are present in varying intensities, while in others, such as the one mentioning her depression, the maladaptive voice is particularly dominant.\r\n\r\nOn one hand, she perceives herself and others as capable and believes in her ability to provide help and support. On the other hand, she sometimes views people as manipulative and exploitative, feeling taken advantage of."
}