{
  "timeline_id": "30c9e21337",
  "posts": [
    {
      "post_index": 1,
      "post_id": "d5257cfb2a",
      "date": "25-02-2015, 22:45:41",
      "post": "FUCK LIFE.\nJust FUCK IT. I fucking hate life. It's so fucking pointless to live. I want everyone to just die. the whole planet to just get obliterated. Fucking bullshit is what all of this is. A big ass fucking farce. I hate life so much. I wish GOD, I FUCKING WISH I HAD THE FUCKING BALLS TO FUCKING SLICE MY WRISTS AND JUST END MY OWN LIFE AT THE VERY FUCKING LEAST. FUCKING BULL SHIT.",
      "Post Summary": "The self state in the post is maladaptive, and centers the expectation of the writer that things will not get better, making her contemplate suicide but criticize herself for not having enough courage to do so. She is very aggressively angry at the world, making her wish everybody dies showing detached cognition of others.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(10) Angry (aggression), disgust, contempt",
            "highlighted_evidence": "I fucking hate life."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I FUCKING WISH I HAD THE FUCKING BALLS"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I want everyone to just die"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I FUCKING WISH I HAD THE FUCKING BALLS TO FUCKING SLICE MY WRISTS AND JUST END MY OWN LIFE AT THE VERY FUCKING LEAST"
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "6c32177ac7",
      "date": "27-02-2015, 17:20:28",
      "post": "[Hello] Excited to join in!\nHi! I'm Alison and I have a kitty named Osita. I wish I could jump right into gifting, because it's hella fun, but no moolah as of now for that. On the extremely bright side, I *should* be starting a job soon (I'm in the hiring process... why is it taking so long though -_-;;), so one day I'll have the cash to join the gifting fun. I really do enjoy gifting communities. I can't wait to get to know you guys, I know you're all lovely people :) Also ask me anything and I'll give you my best answer.",
      "Post Summary": "The writer's self state present in the post is adaptive. it centers the joyful feeling she has for joining the forum. she want's to get to know the others, showing relating behavior, and views them as lovely relating people. She wishes for the autonomy to have money a gift the others, which will become possible once she starts the job she applied for, showing self care behavior. she views herself in a positive light as someone who enjoys gifting.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(5) Content, happy, joy, hopeful",
            "highlighted_evidence": "Excited to join in!"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I *should* be starting a job soon (I'm in the hiring process"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I can't wait to get to know you guys"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I really do enjoy gifting communities."
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I know you're all lovely people :)"
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "so one day I'll have the cash to join the gifting fun"
          }
        },
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 3,
      "post_id": "7b64ddc0c2",
      "date": "07-03-2015, 16:50:54",
      "post": "And then he disabled his account.",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 4,
      "post_id": "4956757c08",
      "date": "30-03-2015, 19:30:39",
      "post": "I'm having an off day.\nI'm on mobile and my thoughts are scattered so bear with me if you decide to read this.   I sort of decided on my own that I'll be fighting depression my whole life. I'm going to be on meds forever, be in and out of therapy, and (I hate to admit it) probably end up hospitalized again at some point. So my battle is to stay stable for as much as I can. I've been doing pretty good for a few months, but inexplicably, today I'm not feeling well. I got out of bed 15 minutes before I had to leave for work even though the alarm was set for an hour earlier. I zoned out a little while driving. I feel the 'fog' lightly looming around me. Do you know what I'm talking about? That awful haze that envelops you when you're depressed and just mutes you from feeling anything.. I don't want it to get worse. I tried to reach out to a friend last night for comfort. I was lonely and needed to connect with someone. But she was saying all the wrong things. things I didn't want to hear. things that just made me boil with anger. And all she was doing was being... positive... Positivity is so sickening and unbelievable and aggravating when I get depressed. anyway. I'm going back to work now. I hope this haze doesn't last too long.",
      "Post Summary": "The dominant self state in the post is maladaptive, and it is centered around the expectation of the writer that the depression will stay with her throughout her life and things will not get better. this expectation leads her to self criticize her ability to cope, following an off day where she feels depressed. the depressive feelings caused her to almost be late for work because she overslept, showcasing self neglect. The depressive symptoms blocked her ability to receive help from the her friend, and to view her as detached. The adaptive self state is also noticeable in the post. it is centered around her desire for things to get better. this wish leads her to try and stay stable, by going to work and receiving help from others. she views the friend that helps her as positive, and willing to help, and herself in a self accepting way, as doing well for the last few months.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": ". I'm going back to work now."
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "tried to reach out to a friend last night for comfort. I was lonely and needed to connect with someone"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I've been doing pretty good for a few months"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "all she was doing was being... positive"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I hope this haze doesn't last too long."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "today I'm not feeling well"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I got out of bed 15 minutes before I had to leave for work even though the alarm was set for an hour earlier. I zoned out a little while driving."
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "But she was saying all the wrong things. things I didn't want to hear."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I'm going to be on meds forever, be in and out of therapy, and (I hate to admit it) probably end up hospitalized again at some point"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "she was saying all the wrong things. things I didn't want to hear. things that just made me boil with anger."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "sort of decided on my own that I'll be fighting depression my whole life. I'm going to be on meds forever, be in and out of therapy, and (I hate to admit it) probably end up hospitalized again at some point. So my battle is to stay stable for as much as I can."
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "f1ea3c60f3",
      "date": "10-04-2015, 18:34:30",
      "post": "BPD or depression\nI don't know if it's BPD or depression but I'm feeling suicidal and very very lonely. my friends all tell me they love me and miss me but somehow it's not enough. I want attention and I guess I'm getting it when they say they love me but it's not *just* right so I'm left longing for something I can't even identify. I'm starting to feel like I should give my cat away because I'm doing a shitty job taking care of her. my family picks up the slack but I still feel that if Im not the one feeding her everyday, I don't deserve to keep her. I also want one less thing to worry about if I kill myself. it reminds me of how giving one's possessions away is a warning sin of suicide lol. I guess my cat is the only important thing in my life.   anyway. I don't know my loneliness is a BPD thing or a depression thing. I honestly don't understand my diagnosis of BPD anyway.",
      "Post Summary": "The main self state in the post is maladaptive, and centers the feeling that her relatedness needs are not being met by others. She views others as detached in the sense that they do not do enough to relieve her of the loneliness she feels. she is feeling depressed and hopeless, making her unable to behave in a caring way towards her cat. she then criticizes herself over it by thinking she does not deserve to keep her cat. The adaptive self state is centered around the writer's desire for attention from others. her friends all tell her they love her and miss her, and are perceived as loving and attached.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "my friends all tell me they love me and miss me"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I want attention"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "don't know if it's BPD or depression but I'm feeling suicidal and very very lonely."
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "I'm starting to feel like I should give my cat away because I'm doing a shitty job taking care of her"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I don't deserve to keep her."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "but somehow it's not enough"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I'm left longing for something I can't even identify"
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "d3fb3d6a73",
      "date": "10-04-2015, 18:44:30",
      "post": "Medication side effects\nIs constant acne and weight gain worth the better mood? I mean, logically it does seem to be worth it, but I really really really don't want to gain any more weight and constantly breaking out is painful for my skin and my (already nonexistant) ego. and while my mood gets better on the med, it doesn't bring me enough motivation to work out so that I can keep the pounds off. I just want to die and not have to worry about life.",
      "Post Summary": "the maladaptive self state is more dominant in this post, and centers around the depression of the writer. the side effects of the medication are painful for her ego, causing her to self criticize, while behaving in a neglecting way. she expects things to not get better, wishing to end things. The adaptive self state is composed of the desire to get better,   causing her to take the meds showing self care behavior, and to view this decision in a self accepting way, showing small hints of hopeful affect.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(5) Content, happy, joy, hopeful",
            "highlighted_evidence": "my mood gets better on the med,"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "Medication side effects"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Is constant acne and weight gain worth the better mood? I mean, logically it does seem to be worth it,"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I really really really don't want to gain any more weight"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I just want to die"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "it doesn't bring me enough motivation to work out so that I can keep the pounds off"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "constantly breaking out is painful for my skin and my (already nonexistant) ego."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I just want to die and not have to worry about life."
          }
        }
      }
    },
    {
      "post_index": 7,
      "post_id": "e1588076f5",
      "date": "11-04-2015, 21:11:25",
      "post": "I want to die.\nmost of my week has been spent lying in bed pretending to not exist and fantasizing about suicide. my life is fine. I'm working part time while I'm off school this semester, I'm trying to stay on track for my career, I have friends that say they love me, my family says they love me, I have a home, food, water, but I still feel incomplete. is it my depression doing this me? regardless of what is causing it, I still feel this way and I just want to die. I have a method and just need a location. but even then I'm just being picky with my location. I could honestly do it anywhere I think.   yeah, I just want to die. every action I do is prefaced by the thought 'I want to die'. when I lie in bed, I think about ways to die. I wish I could make it stop. I don't have it in me to make efforts to distract myself from these thoughts. and that idea in itself is a depressing one to me. is my whole life just going to consist of trying to distract myself from suicide? like how is that living? its not. I would rather not live. I would rather die.  sometimes I think to myself I should have killed myself back in high school. maybe I should kill myself now instead of regretting living even more in the future.  I don't know what I'm doing by posting here. I just want to talk about these suicidal feelings, I guess. sigh. I wish someone would just kill me. I would be grateful.",
      "Post Summary": "the main self state in the post is maladaptive, centers the expectation that life is not going to get better. she is fantasizing about suicide as she is feeling very  depressed, hence spending most of her time in bed neglecting herself. the depression saps her energy, leads her to view herself as powerless to face it. The adaptive self state centers her wish to feel better and make the depressive thoughts go away. for this cause, she is exhibiting self care behavior by putting effort into keeping her career. she feels as if objectively her life is fine, showing some degree of self acceptance, and brings her friends and family who love her as evidence.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I'm trying to stay on track for my career,"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "my life is fine."
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I have friends that say they love me, my family says they love me,"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I wish I could make it stop."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "fantasizing about suicide"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "most of my week has been spent lying in bed pretending to not exist"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I don't have it in me to make efforts to distract myself from these thoughts"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "is my whole life just going to consist of trying to distract myself from suicide? like how is that living? its not. I would rather not live. I would rather die"
          }
        }
      }
    },
    {
      "post_index": 8,
      "post_id": "fa779f6297",
      "date": "12-04-2015, 15:59:31",
      "post": "I want to hire someone to kill me\nlol. how much do you think I'll need?  edit: instead of making new posts I'm just gonna add to this. depression fucking sucks. I'm  a little pissed off. like. I understood having depression when I was wrought with anxiety and stress and life was fucking shit but like.. life is fine right now. like why the fuck do I have this overwhelming need to plan my suicide or die??? like fuck this shit. I just wanna tell everyone that I'm depressed in hopes they'll have some kind of advice or conversation that will maybe pull me out of this mindset ROAR. AHSIDHSLDBSODHC. well at least I'm angry right now. it's preferable to being a useless shit stain that mopes all day.",
      "Post Summary": "The main self state in the post is maladaptive and centers the depressive affect of the writer. the depression makes her want to hire someone to kill her, showing an expectation that things will not get better. she engages in self harm behavior such as planning her suicide, and views herself critically  as a useless shit stain. the adaptive self state centers the wish to get help from others and get better, that leads her to share her needs in the forum and behave in a relating way towards others, while saying life is relatively fine showing self acceptance.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I just wanna tell everyone that I'm depressed"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "life is fine right now."
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I just wanna tell everyone that I'm depressed in hopes they'll have some kind of advice or conversation that will maybe pull me out of this mindset"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "depression fucking sucks"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I want to hire someone to kill me\nlol. how much do you think I'll need?"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I'm angry right now. it's preferable to being a useless shit stain that mopes all day."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I have this overwhelming need to plan my suicide or die???"
          }
        }
      }
    },
    {
      "post_index": 9,
      "post_id": "0966f70863",
      "date": "12-04-2015, 17:59:43",
      "post": "abandonment?\nI don't do the thing where people with BPD will do everything they can to stop perceived or real abandonment. or maybe I do but I can't tell so hear me out. ive been sort of hanging out with this guy Ive been crushing on but he doesn't really seem that into me. after a week of this, I'm suddenly thinking about suicide a lot. for no good reason it seems. am I reacting to being possibly abandoned by the guy? also its weird because I know it will not do anything to stop him from ditching me. in fact, if he straight up told me to leave him alone, I'd agonize over it for a few days but eventually get over it. being left hanging and in the unknown is what really gets me.. anyway idk I just had to ramble about it.",
      "Post Summary": "The maladaptive self state is dominant in the post, and centers the way the writer feels about herself reacting to her relatedness needs not being met by a guy she has a crush on. she views him as not so into her and detached, and notices it  correlates with her suicidal thoughts and depressive affect rising. it seems she is reacting with a very harsh fight or flight reaction to the thought of abandonment, with her body trying to escape the situation so bad that suicide is an option. the adaptive self state is comprised of a desire for relatedness from others, to vent her thoughts about the way she experiences abandonment. she is also behaving in a relating way by sharing this experience, and by dating.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "ive been sort of hanging out with this guy Ive been crushing on"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "just had to ramble about it."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I'm suddenly thinking about suicide a lot"
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "am I reacting to being possibly abandoned by the guy?"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "he doesn't really seem that into me."
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I know it will not do anything to stop him from ditching me."
          }
        }
      }
    },
    {
      "post_index": 10,
      "post_id": "21a1a953dd",
      "date": "13-04-2015, 22:39:19",
      "post": "[Thanks] chaveyf16 for the preppy. i love fountain pens!",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 11,
      "post_id": "f551c7083d",
      "date": "16-04-2015, 21:15:52",
      "post": "[THANKS] imawifebitch, my nails are gonna look SO cool thanks to you :3",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    }
  ],
  "timeline_summary": "The self states in the timeline are mostly maladaptive, with those becoming more dominant when the severity of her expectation that things will not get better, and her depressive affect become more prominent, as these happen throughout the timeline.It seems like in most of the posts, a deliberation of suicide is present. With that being said, the maladaptive voice was almost never present by itself, countered with a bold adaptive one, showing an ability to view the world in a complex manner. that being said, the presence of the adaptive voice deteriorated throughout the timeline, while the maladaptive voice stayed relatively steady or became more dominant."
}