{
  "timeline_id": "43f395b896",
  "posts": [
    {
      "post_index": 1,
      "post_id": "07324d9cc0",
      "date": "13-12-2020, 12:58:37",
      "post": "How does it feel for birds to lay eggs?\nDo they feel an urge, like they have to poop? Do they have to strain or push the egg, or is it more involuntary? Does it hurt?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "0e3bef4a89",
      "date": "16-12-2020, 01:35:59",
      "post": "Found in a cat group on Facebook",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 3,
      "post_id": "3148fd6e42",
      "date": "18-12-2020, 13:12:09",
      "post": "Why do sandwiches taste better cut diagonally?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 4,
      "post_id": "4f92e325b0",
      "date": "22-12-2020, 22:18:23",
      "post": "My promotion is going to end in February after 3 billing periods\nI just got a letter in the mail that my promo rate is ending in February. I just upgraded at the end of November so I'll have had the promo for only 3 months. I was kind of under the impression that my promo rate would last for the duration of my new contract. Is that not the case?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 5,
      "post_id": "2f6ddc5cfe",
      "date": "02-01-2021, 13:15:03",
      "post": "What are you supposed to do if you find a car broken into?\nMy city has a huge problem with auto theft, burglary, and vandalism. Like, you pretty much can't own a car here without it being broken into at some point. Today I noticed a car in my apartment complex's parking lot with the window shattered, the door open, and some stuff on the ground. I felt so bad and wanted to do something, but I'm not sure if there's anything I could have done. I had no way to contact the owner and didn't want to risk implicating myself in any way so I just left it alone. Is that what you're supposed to do? Really sucks for whoever that happened to. 😕",
      "Post Summary": "This post reflects two self-states:\r\n\r\nAn adaptive self-state characterized by empathetic and justifiable anger about witnessing the car break-in. This state also includes relational behavior, as the writer seeks to understand what could have been done in the situation.\r\n\r\nA maladaptive self-state centered on the expectation that nothing could have been done and a subtle fear of getting into trouble if they had tried to help. This state also includes a perception of others as detached, reflected in the writer's remarks about the city’s broader problems and the potential consequences of intervening.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(9) Justifiable anger/ assertive anger, justifiable outrage",
            "highlighted_evidence": "I felt so bad and wanted to do something"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Is that what you're supposed to do? Really sucks for whoever that happened to."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "didn't want to risk implicating myself in any way"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "My city has a huge problem with auto theft, burglary, and vandalism"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "but I'm not sure if there's anything I could have done"
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "633a7a79b4",
      "date": "11-01-2021, 04:00:17",
      "post": "Anyone else get super uncomfortable at clubs or parties where people are trying to hook up?\nA lot of if is just due to me being an introvert but I hate pretty much any social event where it's expected that people are going to be hooking up. I don't even want to talk to people I don't know because I don't want anyone getting the wrong idea.",
      "Post Summary": "The adaptive self-state is subtle but can be observed in the mention of being an introvert and seeking acknowledgment in the post about their feelings in the situation. This may also indicate a level of self-acceptance regarding certain traits.\r\n\r\nThe maladaptive self-state is reflected in the expectation of not being understood by others, which contributes to anxiety in social situations. This is accompanied by elements of self-criticism.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "Anyone else get super uncomfortable at clubs or parties where people are trying to hook up"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "A lot of if is just due to me being an introvert but I hate pretty much any social event where it's expected that people are going to be hooking up"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I don't even want to talk to people I don't know because I don't want anyone getting the wrong idea"
          }
        }
      }
    },
    {
      "post_index": 7,
      "post_id": "2e0463374c",
      "date": "18-01-2021, 03:59:40",
      "post": "WHERE ARE YOUR SHOES?? FREEZE TO DEATH, DUMBFUCK",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 8,
      "post_id": "9192291064",
      "date": "29-01-2021, 02:42:00",
      "post": "Those who've tested positive after receiving both doses of the vaccine, what was your experience?\nDid you have symptoms? How severe were your symptoms, and how long did they last?  I'm just curious. Just got my first dose of the moderna vaccine. I know with the flu vaccine you're less likely to experience severe symptoms or complications if you do get the flu, but the COVID vaccines haven't been around long enough to have that kind of data  yet.",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    }
  ],
  "timeline_summary": "A noticeable fluctuation is evident between the two posts, with the adaptive self-state being more prominent in one post, while the maladaptive self-state dominates the other. There appears to be some connection to the self and empathy toward others, but also a recurring perception that others are unable to understand the writer."
}