{
  "timeline_id": "46f4bb3ada",
  "posts": [
    {
      "post_index": 1,
      "post_id": "b840ef8ca5",
      "date": "13-10-2019, 08:03:19",
      "post": "I’m going to bed now\nI can’t imagine myself alive next year. Should I just give up on school and everything else right now because I know I’m going to die anyways. Not sure what I should do",
      "Post Summary": "One prominent self-state in this post is characterized by thoughts of self-harm and hopelessness, along with evident avoidance through sleep.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "Should I just give up on school and everything else right now because I know I’m going to die anyways"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I’m going to bed now"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I can’t imagine myself alive next year"
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "220c16e374",
      "date": "18-10-2019, 07:56:51",
      "post": "what I wish I could say to my parents\nI’m not lazy. I have depression and anxiety and doctors literally told you the other day. Everything is hard for me right now. Even the things you’re supposed do daily takes too much energy to do. I hope you can stop prioritizing school but me instead for a little while so I can heal. My thoughts are not silly or a teenage phase either and taking antidepressants won’t cure everything immediately. I know you guys keep telling me other people have it worse than me but I can’t help feeling like this. You made me promise you that I would go to school tomorrow but I honestly don’t think I can. I’m too scared to and thought of it makes me want to die. So please shut up about school just for a little while, please. I’m sorry for being such a disappoint.",
      "Post Summary": "Two self-states are recognized. One is very subtle, almost nonexistent, and is tied to his suffering, where he comes to an acceptance of it, realizing it is not trivial. The dominant self-state is marked by a depressed affect, with his parents perceived as unattuned to his needs by making him to go to school, which he finds unbearable. He expresses fear, which intensifies his desire to die, and has a negative self-cognition, viewing himself as a disappointment.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "My thoughts are not silly or a teenage phase"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "Everything is hard for me right now"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I’m sorry for being such a disappoint."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I hope you can stop prioritizing school but me instead for a little while so I can heal"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I’m too scared to and thought of it makes me want to die"
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "a24dc65ba5",
      "date": "18-10-2019, 09:24:46",
      "post": "lololol",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 4,
      "post_id": "40127b337b",
      "date": "18-10-2019, 17:34:55",
      "post": "aww",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 5,
      "post_id": "082f9ac618",
      "date": "18-10-2019, 20:18:25",
      "post": "OHH",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 6,
      "post_id": "be182f0924",
      "date": "20-10-2019, 04:27:49",
      "post": "I could never",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 7,
      "post_id": "eb2c89638d",
      "date": "21-10-2019, 20:44:01",
      "post": "coach of the year",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 8,
      "post_id": "26dc61f143",
      "date": "21-10-2019, 22:09:34",
      "post": "If we remove all laws then the crime rate would be 0%",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 9,
      "post_id": "1c66c359a2",
      "date": "29-10-2019, 08:29:00",
      "post": "Frickk im so freakin scared to go to school tomorrow but it’s gonna be okay I can do it hopefully I can do this yep I can okokok I will I have to im gonna go for sure I know I can everything will be fine",
      "Post Summary": "Two self-states are apparent here. One is characterized by belief in himself, with a hopeful mindset that everything will be okay and that he is capable. The other reflects an anxious affect related to the prospect of going to school.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I know I can"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "hopefully I can do this"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "Frickk im so freakin scared to go to school tomorrow"
          }
        }
      }
    },
    {
      "post_index": 10,
      "post_id": "068538dc83",
      "date": "06-11-2019, 07:10:03",
      "post": "Y’all my mom is hilarious she said “just be happy why are u like this everyone wants to be friends with you” lol okay mom I’ll do just that. after knowing about my suicide attempts she said “you’re such a good girl y would u do that” omg I’m a good girl? Thanks 4 telling me I won’t try to die anymor\n[removed]",
      "Post Summary": "One self-state recognized in this post is cynicism towards the mother, who is seen as detached and not understanding her daughter's situation. The mention of suicide attempts and self-harm highlights maladaptive behaviors, while the cynical remark \"OMG, I'm a good girl\" reflects a perception of self-criticism.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "Thanks 4 telling me I won’t try to die anymor"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "omg I’m a good girl"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "okay mom I’ll do just that"
          }
        }
      }
    },
    {
      "post_index": 11,
      "post_id": "391e9057c2",
      "date": "18-11-2019, 10:09:51",
      "post": "People who don’t have anyone to eat lunch at school with where do you go?\nI don’t have anyone to eat with so I just go home but I’m tired of having to walk home everyday since our lunch break is only 40mins and it takes around 7mins to walk home and back. Any ideas where else I could eat lunch",
      "Post Summary": "There are two self-states. One is characterized by self-care behaviors aimed at improvement, reducing loneliness, and disengaging from avoidance behaviors. The other self-state expresses feelings of loneliness and the presence of avoidance behaviors.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "People who don’t have anyone to eat lunch at school with where do you go"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(14) Feel lonely",
            "highlighted_evidence": "I don’t have anyone to eat with"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "so I just go home"
          }
        }
      }
    },
    {
      "post_index": 12,
      "post_id": "e36e46ced7",
      "date": "05-12-2019, 12:50:33",
      "post": "felt like the psychiatrist was judging me because I told her I’ve tried to commit suicide 2 times\nShe asked me a series of questions and then asked how many times have I tried to commit suicide and I said two. She repeated back “two?” and I said yeah. The tone she said it in sounded like “pft only twice that’s so less” if you know what I mean. I could be remembering it wrong but I’ve been thinking about it since the meeting. Is being suicidal for 2 years and only attempting it twice weird?",
      "Post Summary": "The dominant self-state reflects the writer's perception of the psychiatrist as judgmental regarding her suicide attempts. She feels the psychiatrist is detached and also engages in self-criticism about her thoughts and attempts, questioning if the attempts are insufficient.\r\n\r\nA faint subtext can be heard, where there seems to be a desire for validation about her situation—perhaps because it feels unusual that she has a chance to improve and that not everything is hopeless.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "only attempting it twice weird"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I’ve been thinking about it since the meeting. Is being suicidal for 2 years and only attempting it twice weird?"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "felt like the psychiatrist was judging me because I told her I’ve tried to commit suicide 2 times"
          }
        }
      }
    },
    {
      "post_index": 13,
      "post_id": "79428ef266",
      "date": "06-12-2019, 08:59:33",
      "post": "where’s the rest of the gang",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 14,
      "post_id": "984f9848fe",
      "date": "07-12-2019, 10:41:19",
      "post": "I need a serotonin army",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 15,
      "post_id": "41fe1222e8",
      "date": "09-12-2019, 10:31:48",
      "post": "true dat",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    }
  ],
  "timeline_summary": "The dominant self-state is marked by an anxious and depressed affect, accompanied by avoidance and self-harm behaviors, with a perception of others as detached and not understanding her.\r\n\r\nThe adaptive self-state is a faint attempt to be attuned to her own needs, though it is close to engaging in avoidance behaviors as a way to temporarily feel better."
}