{
  "timeline_id": "5da839acb5",
  "posts": [
    {
      "post_index": 1,
      "post_id": "d06936d838",
      "date": "06-10-2019, 10:42:36",
      "post": "A heart’s a heavy burden.\nI’m at this point in my life currently where I’m somehow stuck between feeling the ache of everything, and not feeling anything at all. I was taught from a young age that the “only” way to cope with all the hurt is to flip the switch and turn it off - and now all the switches and wires feel flipped and intertwined and I can’t make sense of a single damn thing.  It’s hard to talk to people about the mess of emotions I feel, or the jumbled thoughts I have. I know people care about me, at least some of the time, but not enough for me to feel okay with talking about the things that keep me up at night. It’s a really lonely, isolating feeling to have. But god, I wish anyone cared more than the bare minimum. Enough to reach inside my chest and rip the hurt right from the comfortable place it rests, covered up by all the excuses and lies I use just to make it through each day.  There’s so much that’s happened this year, so much I’ve let people get away with because my heart is just a little too big for blame and anger to hold onto. I’m so drained though, and I’m so sick of making myself feel small in hopes I’ll fit into people’s lives. And I’m scared, because it hasn’t gotten any better. I don’t know if it will.  Writing all of this is pretty pointless, but at least if you tell it to the void, the void can’t talk back and tell you to suck it up or stop complaining.",
      "Post Summary": "The dominant self state in the post is maladaptive and centers the writer's feeling that she is both sick of making himself feel small in front of others, but also doesnt see it stopping, fearing his relatedness needs will never be fulfilled. it causes him to feel so depressed she is disconnecting from himself and descend to apathy, something she learnt when she was little, that when it hurts you should neglect your feeling and disconnect. she is self critical, pointing how she makes excuses and lies to make it through the day,  and she feels as if its hard to talk about his emotions with others, because she feels uncomfortable sharing with them as they are viewed as detached. The adaptive self state centers his wish for relatedness, for someone to care about him, and she recognizes that some people do care about him, and that she has good qualities too - like a big heart.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "my heart is just a little too big for blame and anger to hold onto"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I know people care about me, at least some of the time"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I wish anyone cared more than the bare minimum."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I’m somehow stuck between feeling the ache of everything, and not feeling anything at all."
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "the “only” way to cope with all the hurt is to flip the switch and turn it off - and now all the switches and wires feel flipped and intertwined and I can’t make sense of a single damn thing"
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "It’s hard to talk to people about the mess of emotions I feel, or the jumbled thoughts I have"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "reach inside my chest and rip the hurt right from the comfortable place it rests, covered up by all the excuses and lies I use just to make it through each day."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "not enough for me to feel okay with talking about the things that keep me up at night. It’s a really lonely, isolating feeling to have."
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I’m so drained though, and I’m so sick of making myself feel small in hopes I’ll fit into people’s lives. And I’m scared, because it hasn’t gotten any better. I don’t know if it will."
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "49866ff6f6",
      "date": "11-10-2019, 05:39:48",
      "post": "Feeling like a waste of space.\nEvery time I go to make a post here I get annoyed with myself because honestly, who fucking cares lol. But I'm just drained and need an outlet to vent so here I am yet again.  I know everyone moves through life at different paces, and not everything is as good as it seems, even for people who are more fortunate than others. Even still, I feel like I'm not where I'm meant to be at all and it's slowly killing me. So many people I know are getting their shit together - getting in happy relationships and starting families, having their own homes, and living their best lives. And I know I shouldn't be so worried about that stuff at 23, but fuck. I've been dealt shitty cards from the start and I'm sick of not having anything good for myself. I'm sick of feeling like a shadow in this world.  On top of that, I'm getting increasingly lonely, and usually I can control this feeling and not let it get to me but we all know the role depression plays in making you feel isolated. It's so hard to make friends though. Every time I open up to  someone, or try to build a connection with them, in the end I'm not good enough and they leave. I've stopped reaching out to people because I'm so sick of that cycle repeating. I don't want to keep opening up my heart to people just for them to crush it.  In conclusion, people suck and so does life.",
      "Post Summary": "The dominant self state in the post is maladaptive. it centers the fear that his relatedness needs will not be met, and she will keep on getting hurt because of it. this fear is based in experience, that lead him to believe others are detached as they leave him after a short introduction. it makes him react in a fight or flight way, by fleeing connectedness and not reach out to people anymore. the depressive affect is fueling this whole self state, and makes him very self critical as well - stating she is a waste of space. The adaptive self state in the post centers the desire to become more competent, and not live like a shadow in the world anymore. it gives him the strength to share his needs on the forum, a relating behavior, when she feels drained.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I'm just drained and need an outlet to vent so here I am yet again"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I'm sick of feeling like a shadow in this world."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "feel like I'm not where I'm meant to be at all and it's slowly killing me."
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "I've stopped reaching out to people because I'm so sick of that cycle repeating."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Feeling like a waste of space."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "Every time I open up to  someone, or try to build a connection with them, in the end I'm not good enough and they leave."
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I've stopped reaching out to people because I'm so sick of that cycle repeating. I don't want to keep opening up my heart to people just for them to crush it.  In conclusion, people suck and so does life."
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "fdfc4cd408",
      "date": "12-10-2019, 08:11:43",
      "post": "Breaking point.\nI don’t have anyone I can talk to about this. I try to go to people, try to open up to them, put myself in a vulnerable place and all it ever does is fuck me over and make the hurt of everything that much worse.  I feel sick to my stomach with guilt for feeling this way. My best friend lost someone she loved unexpectedly earlier this year, and I don’t want her to lose another, but it’s all I can feel and think about lately.  I’ve tried to make good changes in my life. I’ve gone to therapy. I went back to school. I tried making friends. I tried dating. In the end, nothing is enough. I’m not enough. There’s always something wrong, either with me or the timing and circumstances.  My heart feels shattered and I feel beside myself with it all. I don’t see the point anymore. I’m never going to have that life I dreamed of. I never asked for much. I just wanted something good to happen. I wanted to be good enough, deserving enough. But I have nothing and no one. Just this ache that won’t go away.",
      "Post Summary": "The dominant self state in the post is maladaptive. it centers the writer's expectation that things will not go his way, and will not get better for him in his social life. this expectation is fueled by severe depressive affect, and by the experience of fighting for connectedness only to be rejected and then blame the other. together, this behavior affect and expectation takes the writer to view others as detached, and criticize himself for being the reason for the failure. The adaptive self state in the post centers the cognition of his best best friend as relating and close, and through not wanting to hurt her, she is able to not commit suicide, and seek a change in his life by going to therapy for example, showing self-care behavior.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I’ve tried to make good changes in my life. I’ve gone to therapy. I went back to school. I tried making friends. I tried dating."
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "My best friend lost someone she loved unexpectedly earlier this year, and I don’t want her to lose another,"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "My heart feels shattered and I feel beside myself with it all. I don’t see the point anymore"
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "I try to go to people, try to open up to them, put myself in a vulnerable place and all it ever does is fuck me over and make the hurt of everything that much worse."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I’m not enough. There’s always something wrong, either with me or the timing and circumstances"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I don’t have anyone I can talk to about this."
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I’m never going to have that life I dreamed of. I never asked for much. I just wanted something good to happen. I wanted to be good enough, deserving enough. But I have nothing and no one. Just this ache that won’t go away."
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "930097b1c5",
      "date": "20-10-2019, 01:46:18",
      "post": "drained.\ni don’t really have the words right now for how i feel, except that it’s miserable. i don’t have anything or anyone to keep me going anymore, and i’m still hung up over someone who couldn’t care less if i was alive or dead. i’m trying to keep my shit together because my best friend needs me, but i’m just tired and things have only been getting worse. i don’t think i’ll be here come next year and i feel sick at the thought.",
      "Post Summary": "The dominant self state in the post is maladaptive and centers the expectation that things will not get better, and the writer will not stay alive by next year. this expectation is fueled by the cognition of others as detached as the writer feels others dont care about them, and by a self-critical voice criticizing themselves. both of these also lead to a depressed affect. The adaptive self state is centered around the desire to help her friend, that is fueled by the cognition of her as a loved close friend. this connection holds off the imposing suicide attempt and cope with the difficulties.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "i’m trying to keep my shit together"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "i’m trying to keep my shit together because my best friend needs me"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "i’m trying to keep my shit together because my best friend needs me,"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "i don’t really have the words right now for how i feel, except that it’s miserable."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "i’m still hung up over someone who couldn’t care less if i was alive or dead"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "i don’t have anything or anyone to keep me going anymore, and i’m still hung up over someone who couldn’t care less if i was alive or dead."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "i’m just tired and things have only been getting worse. i don’t think i’ll be here come next year"
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "6e909f106a",
      "date": "23-10-2019, 22:38:05",
      "post": "Hitting like a train today.\nWe haven't spoken in several months, and it's not really getting any easier. It comes and goes in waves, and it hits hard when I least expect it. Today I gave that new song \"If The World Was Ending\" a listen and it shattered me on the spot; it's that easy for me to spiral into missing him, and I hate it.  I hate that I still miss him - not even romantically (okay maybe a little), but overall, his friendship and his presence in my life. It's such a shitty feeling to have the door slammed on you, so to speak. I know that closure is a tricky construct, and that sometimes you have to make it for yourself, but I'm really struggling in that regard. I truly feel like this is something I'll carry with me to my grave, and that eats away at me.  This month has been a real struggle overall. This time last year was the last time we were okay, before things completely broke apart. I broke contact and tried reaching out to him a couple of weeks ago, which was stupid of me and I know that, and he made it pretty clear he has no interest in ever speaking again. I know in the end it's for the best, but right now it's miserable and I wish I could turn back time.",
      "Post Summary": "The main self state in the post is maladaptive and centers the expectation that the heartbreak the writer feels will not get better. this leads them to feel hopeless, and try to solve that by forcing connectedness on the romantic counterpart that rejected them, only to be rejected again which results in a detached cognition of them, and self criticism. The adaptive self state is composed of emotional pain due to this heartbreak, allowing the writer to learn from this in the future showing self-compassion and a belief in the self to grow from this.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "it's that easy for me to spiral into missing him, and I hate it.  I hate that I still miss him"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I know in the end it's for the best,"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I truly feel like this is something I'll carry with me to my grave, and that eats away at me."
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "I broke contact and tried reaching out to him a couple of weeks ago"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "which was stupid of me and I know that,"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "he made it pretty clear he has no interest in ever speaking again."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I truly feel like this is something I'll carry with me to my grave, and that eats away at me"
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "b7efbe6603",
      "date": "02-11-2019, 07:57:18",
      "post": "This is killing me.\nI was looking through our old Discord chat *(stupid, I know),* and it just... kills me. He was by far the most supportive person in my life for all the months we were together. Not even my best friend comes close to being as sincere and sweet as he was. No one has ever made me feel even a fraction of the way he did.   Any new ideas I had, he encouraged me and gave input. If I was feeling down or sick, he'd stream cartoons for us to watch together until I felt better. He always sent me new songs because he knew I'd be stubborn and play old ones on repeat all day otherwise. He sent the best damn memes and made me laugh more than anyone ever did. And when we called, it was always so comfortable and we'd talk for ages about every little thing. He never complained if I babbled on like an idiot.  This is fucking me up and I can't get past it at all. I don't know what to do. I always just cry it out and then sleep it off, but the cycle repeats and I'm growing weaker. When he left he said I'd find someone like him again, but God, there's only one him and I can never get that back.",
      "Post Summary": "The main self state in the post is maladaptive and centers the expectation that the writer will never find another romantic partner as good as the ex. it is fueled by idealization of that ex-boyfriend, setting an impossibly high standard making it impossible to be happy again, thus feeling despair, and neglecting the self by sleeping this off.  The adaptive self state is composed of the adaptive grieving for this ex boyfriend.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "I was looking through our old Discord chat *(stupid, I know),* and it just... kills me."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "the cycle repeats and I'm growing weaker."
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I always just cry it out and then sleep it off,"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "He was by far the most supportive person in my life for all the months we were together."
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "there's only one him and I can never get that back."
          }
        }
      }
    },
    {
      "post_index": 7,
      "post_id": "da20343212",
      "date": "03-11-2019, 06:41:08",
      "post": "Miserable and guilty.\nMy best friend’s birthday is tomorrow and all I can think about is how badly I want to end my life, but I can’t because I can’t do that to her.  I feel so empty and beside myself.",
      "Post Summary": "The self state in the post is maladaptive. it centers the feeling of guilt the writer feels, as they expect things to not get better for themselves and for them to end their life. this expectation is fueled by their view themselves as empty. The adaptive self state consists of the writer viewing his best friend as related, hence they are not committing suicide because that would hurt her.",
      "Well-being": 1,
      "evidence": {
        "adaptive-state": {
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "but I can’t because I can’t do that to her."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(12) Ashamed, guilty",
            "highlighted_evidence": "Miserable and guilty.\nMy best friend’s birthday is tomorrow and all I can think about is how badly I want to end my life, but I can’t because I can’t do that to her"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I feel so empty and beside myself"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "all I can think about is how badly I want to end my life,"
          }
        }
      }
    },
    {
      "post_index": 8,
      "post_id": "30d8f4338e",
      "date": "04-11-2019, 09:15:38",
      "post": "I hate it more than anything.\nI’m so sick of having to pretend I’m okay because it’s more convenient for everyone around me. “You seem better” is the biggest load of shit. I’m not better, I’m so far from it. I’ve just gotten better at making you think I’m okay, because then I don’t have to hear that I’m being difficult or stupid or irrational.  I just want to leave this fucked up world behind. I’m over it all.",
      "Post Summary": "The self state in the post is maladaptive. it centers the self defeating thoughts of the writer that they are not better and far from it. these thoughts make the writer feel sick of being overly controlled in the sense that they are pretending to be better for others, and in turn angry about it. they view others as detached for not seeing how she is not getting better, and the result is wanting to die.",
      "Well-being": 1,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(10) Angry (aggression), disgust, contempt",
            "highlighted_evidence": "hate it more than anything."
          },
          "B-O": {
            "Category": "(4) Over controlled or controlling behavior",
            "highlighted_evidence": "I’m so sick of having to pretend I’m okay because it’s more convenient for everyone around me"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I’m not better, I’m so far from it."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "“You seem better” is the biggest load of shit"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I just want to leave this fucked up world behind. I’m over it all."
          }
        }
      }
    },
    {
      "post_index": 9,
      "post_id": "422dd6f5c4",
      "date": "07-11-2019, 05:47:48",
      "post": "It’s never going to get better is it?\nEvery single day is the same. I can go out and convince everyone, including myself, that I’m okay. But then I come home and the heavy feelings set in and I fall apart.  I’ve been losing sleep because my mind won’t shut off. I just keep thinking about how much better things were before, but then questioning if they were ever really better at all.  I’m tired of falling apart every night and having to put myself back together every morning. I’m tired of being around people who have better lives than me. I’m tired of being bitter and angry at the world.  I want to die, but I don’t. I want everything to stop, but it isn’t. I want things to change, but they haven’t.  I just want to feel safe again.",
      "Post Summary": "The main self state in the post is maladaptive and centers the feeling that things will not get better for the writer. this expectation makes them feel depressed, to lose sleep, and to dislike others who have \"better lives\" than the writer. the adaptive self state is composed to the wish to get better and feel safe again.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I want things to change,"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "But then I come home and the heavy feelings set in and I fall apart."
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I’ve been losing sleep because my mind won’t shut off"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I’m tired of being around people who have better lives than me."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "It’s never going to get better is it?"
          }
        }
      }
    },
    {
      "post_index": 10,
      "post_id": "8bf58653ec",
      "date": "19-11-2019, 05:31:26",
      "post": "It’s getting worse.\nI realized today that his birthday’s coming up in a few weeks, which really puts into perspective how much time has passed since we were last okay. Before everything crashed and burned. I’ve been numb this whole year, just floating through time because reality is miserable and I can’t face it, but I’m starting to more and more lately and I’m miserable for it.  Holidays and family events were always the worst for him, for both of us really. I miss how we’d help each other through it, being the strength for each other that we needed. All I feel now is weak, like a fragile shell of a girl I used to be.  There’s so much I wish I could say to him. Losing the opportunity to spend my life with him is painful, but nothing beats the pain of losing the friendship we had. He was my very best friend and I’ll never get that back, and it kills me every god damn day. I’ll never feel that good or whole again.  I don’t think time is healing anything.",
      "Post Summary": "The main self state in the post is maladaptive, centers the expectation that the writer will never feel as good as she felt in the relationship she had with her ex. she idolizes him and the relationship she had with him, which takes her to self criticize her current self without him. this makes her feel blunted, as she is dissociating from feeling because it hurts too much. The adaptive self state is composed of the grieving the writer is going through.",
      "Well-being": 1,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "I miss how we’d help each other through it, being the strength for each other that we needed"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(8) Apathic, don’t care, blunted",
            "highlighted_evidence": "’ve been numb this whole year, just floating through time because reality is miserable and I can’t face it"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "All I feel now is weak, like a fragile shell of a girl I used to be"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "There’s so much I wish I could say to him. Losing the opportunity to spend my life with him is painful, but nothing beats the pain of losing the friendship we had. He was my very best friend"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I’ll never get that back, and it kills me every god damn day. I’ll never feel that good or whole again.  I don’t think time is healing anything."
          }
        }
      }
    }
  ],
  "timeline_summary": "Throughout the timeline, the self states were mostly maladaptive, sometimes present by themselves with no adaptive counterparts. this very severe maladaptive dominance was mainly characterized by the expectation that the writer will hurt themselves, and that their relatedness needs will never be met. the two intertwined throughout the timeline. these were strongly influenced by the presence of idealization of the ex boyfriend. that being said, the adaptive cognition of her best friend as someone she loves, allowed her through most of the timeline to postpone her suicide plans. this adaptive voice grew weaker by the end of the timeline."
}