{
  "timeline_id": "62defd8df2",
  "posts": [
    {
      "post_index": 1,
      "post_id": "b60098236e",
      "date": "02-04-2019, 19:40:55",
      "post": "Feeling as if I go cross eyed?\nI have OCD &amp; anxiety and usually when talking to people (which often makes me subconsciously stressed/uncomfortable due to intrusive thoughts and overthinking) I get this feeling that my eyes are crossing?   *Apparently* they aren’t according to other people. When it’s bad I obsessively check it in my camera and take lots of photos just to make sure. does anyone else experience this? Is it my OCD tricking me again? Making me hyper aware of everything my body is doing? Or is it something else. I can’t find anything on google about it.   Thank you in advance   /r/Anxiety /r/SocialAnxiety /r/ocd /r/MentalHealth",
      "Post Summary": "The dominant self-state is characterized by an anxious affect, stemming from intrusive thoughts about being cross-eyed in social situations, leading to compulsive behaviors such as constantly checking for reassurance.\r\n\r\nThe more subtle, adaptive self-state involves attempting to engage in self-care by understanding the underlying mechanisms and seeking advice from others for support.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I can’t find anything on google about it"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Thank you in advance"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "When it’s bad I obsessively check it in my camera and take lots of photos just to make sure"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": ". When it’s bad I obsessively check it in my camera and take lots of photos just to make sure"
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "cb48f7e5e5",
      "date": "17-04-2019, 20:12:31",
      "post": "I’m so lonely please help\nHello :)  I’m so lonely all the time. The friends I did have I didn’t consider quality friends and I cut them off when I noticed I wasn’t being invited to things anymore. I have felt lonely deep in my soul for about four years now and I don’t know how to shake it.   I feel depressed a lot and I believe it’s the reason I have lost my sense of self. I also suffer from (social) anxiety and OCD (pure o). I cant make connections with people because I feel so empty, I don’t trust my social skills or my personality to carry me. I feel like everything I do is fake (maybe partly due to the nature of my OCD). So it’s not even like ‘joining a club’ would help me at this point. I need to work on myself first. But it’s so hard with no one to talk to or do things with.   Everything feel so meaningless now. I look at everyone else making connections with people and at the very most I can do small talk. I am truly pathetic. My social anxiety mixed with OCD and depression feels crippling. I feel as though I’m missing out on one of the best times in my life. I’m on the outside looking in at everyone having fun and being capable. I know everyone likely suffers from some form of mental illness and is just putting on a brace face, but I feel it’s so much easier when those people have good friends, plans, jobs, reasons to wake up.   Can anyone give me any advice / stories that will give me hope to continue.   Thank you :) /r/SocialAnxiety /r/depressed /r/Depression /r/help /r/MentalHealth /r/ocd /r/Advice",
      "Post Summary": "The dominant self-state is maladaptive, characterized by feeling deeply lonely. This loneliness stems from self-criticism, where they view themselves as truly pathetic and perceive others as detached, especially when not invited. There is an expectation that their competence needs will not be met, and they lack trust in their ability to change the situation.\r\n\r\nThe other self-state, driven by the first, is more adaptive, focused on seeking self-care and the help of others. They recognize the need to work on themselves and are actively seeking advice.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "please help"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Can anyone give me any advice / stories that will give me hope to continue.   Thank you"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(14) Feel lonely",
            "highlighted_evidence": "I’m so lonely all the time."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I am truly pathetic"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I noticed I wasn’t being invited to things anymore."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I don’t trust my social skills or my personality to carry me."
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "3663fd047a",
      "date": "29-04-2019, 16:35:41",
      "post": "Liquid silicone or liquid latex?\nHi,   I’m a complete amateur. I have to make a short film for college and for my film I will have to use some special effects make up. I want to make my characters cheekbones/lips bigger etc. How can I achieve this on a budget?   I want it to sort of resemble ‘lady in the radiator’ from eraserhead but slightly less extreme. Thanks 😀",
      "Post Summary": "The adaptive self-state involves seeking help and advice from others on a topic the writer feels uncertain about.\r\n\r\nThe maladaptive self-state is characterized by viewing herself as a complete amateur, coupled with self-criticism and low self-esteem.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Thanks"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Hi,   I’m a complete amateur"
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "f1180c97cd",
      "date": "07-05-2019, 17:28:12",
      "post": "I think there’s something very wrong with me.\nHello reddit   Just a disclaimer before I write this. I have depression, anxiety, suspected OCD and social anxiety. :) I have not taken any meds for any of them.   But other than those...I just think there’s something really wrong with my personality. I’m writing this because I can’t get it out of my head and I’m wondering if anyone has any tips or feels the same. I can’t stop thinking there’s something just completely wrong with ME. which is part of the problem in itself I guess.    Up until this point in my life I’ve always thought I’ve just been shy. But now I’m rethinking my entire life. What if I have NO IDEA how to socialise. I’m afraid of being obnoxious or annoying or a burden so I don’t really talk that much (no one has ever said I have before so I don’t know where this has come from, but it’s been since I was little) I keep my answers to things at a minimum. I just thought this is how I was with people I’m not really close with (including my family) - id rather talk about them not me. But now im thinking what if I’m so painfully awkward I have no idea how to elaborate, be enthusiastic (depression?) and have a full conversation. I can’t tell stories!!! I stutter and I get nervous, even if it’s a banging story. ( I think no one cares) is it low self esteem or am I socially inept? I can’t trust myself. I want to be witty and funny and NOT awkward with everyone, but I seem so be so painfully reserved I have no idea how. It must just be ingrained in my personality.   In reality, in my rational, not mentally ill brain, i DONT CARE about being judged. I know people don’t think about my mistakes or even notice them in the same way that I do. But it’s something I cannot shake. And it’s awful. There must be something up.   **i struggle in social situations:**i used to have friends up until recently. I cut them off (or rather we cut each other off as they haven’t reached out since) because I couldn’t get the idea that they hated me out my mind. Every time I met them I felt cripplingly insecure. I stopped being invited to things. We had been friends for about a year prior and I think at some point my brain just snapped? I hated my personality. I felt like everyone was laughing at me. But anyway, I’ve always considered myself a shy person, but not totally socially inept. But now I’m wondering if I am socially inept??? My brain goes blank sometimes, my heart beats fast and I can go red. I speak SO QUIETLY. I’m so unsure of everything I say. I feel embarrassed when I talk. I’m awkward. I listen to other people talk with ease and I’m just in awe. How do they do that? I am good with eye contact but due to OCD (I’ve been told) I am hyper aware of everything I’m doing. I also get intrusive thoughts. Once I realise I’m making eye contact I freak out, think I’m going cross eyed or something. I feel utterly hopeless. I don’t know how to make friends anymore. Did I ever? I’m second guessing every single thing about my personality. I feel unlikable and unnoticeable.   I have a constant inner monologue, which is semi normal as far as I’m aware - but every time I speak I think I overthink. It’s less of a voice telling me everything I say is stupid but more of a feeling. I’m worried I’ve lost all my social capabilities. I can’t trust myself so how would I know? Apparently it’s not as visible on the outside. I seek reassurance (ocd), not too much because it’s really annoying lol but if I’ve just interacted with someone and I’m with my boyfriend, after that’s over I’ll ask him things like “was that ok? Did I sound weird? Did I look weird?”. My family have joked that I have ‘personality dysmorphia’ lol. Is that even possible.   I’m just really scared because I don’t want to be socially inept. I’m seeing something that others don’t as well. I just want to socialise with ease. If I CAN get rid of the anxiety I just get worried about what I’ll say and my mind goes blank. If in the moment I’m ok, afterwards I’ll overanalyse it.   It’s gotten to the point where I don’t even know if I’m not being myself because I don’t know what myself is. I CANNOT trust myself. I just want to skip through the cracks. I’m worried I’ll upset or hurt people if I talk to them too which is slightly irrational. I’ll beat myself up for weird things I’ve done and I’ll remind myself I haven’t even done or said that?????   Also sometimes I feel completely STUCK and unable to say something. And sometimes I’ll think of something to say or want to say something and I’ll think nah that’s stupid or something and someone else will say it out loud and I’m like oh. A sign from the universe that I’m perhaps not as bad as I think? I prefer groups to one on one because there’s less pressure and it’s easier to blend in. I’ll avoid people around college because I’m scared of confrontation. I can’t connect with people anymore (have I ever been able to?) I’m basically worried that I’m really weird because I must be so awkward. Being hyper aware of everything I’m doing is hard. I feel like I look like a new born giraffe when I walk. I can’t connect with anyone I feel.   Is it my mental health (something fixable) or is it something else?     Please help Anyone :)  /r/SocialSkills /r/SocialAnxiety /r/ocd /r/MentalHealth",
      "Post Summary": "There is a subtle adaptive self-state centered around the desire to fit in and feel connected in social situations. This is accompanied by the realization that others don’t notice every mistake, which is an important insight. Additionally, there is a seeking of help from others.\r\n\r\nThe dominant, maladaptive self-state is characterized by rumination, with intrusive thoughts that induce significant anxiety. This is followed by deep self-criticism, feelings of being stuck and unable to communicate, and the perception that others will be detached or unaccepting.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "Please help"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I’m wondering if anyone has any tips or feels the same"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I know people don’t think about my mistakes or even notice them in the same way that I do"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I just want to socialise with ease"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "My brain goes blank sometimes, my heart beats fast and I can go red."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I CANNOT trust myself"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I couldn’t get the idea that they hated me out my mind"
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "fa7834e029",
      "date": "07-05-2019, 23:04:35",
      "post": "Worried there’s something wrong with me other than mental illness.\nHello reddit   I think something is wrong with me other than mental illness. But I can’t even tell if it’s my OCD making me think this anymore. Has my OCD latched onto something? What if I am just really really unable to function.    Just a disclaimer before I write this. I have depression, anxiety, suspected OCD and social anxiety. :) I have not taken any meds for any of them.   But other than those...I just think there’s something really wrong with my personality. I’m writing this because I can’t get it out of my head and I’m wondering if anyone has any tips or feels the same. I can’t stop thinking there’s something just completely wrong with ME. which is part of the problem in itself I guess.    Up until this point in my life I’ve always thought I’ve just been shy. But now I’m rethinking my entire life. What if I have NO IDEA how to socialise. I’m afraid of being obnoxious or annoying or a burden so I don’t really talk that much (no one has ever said I have before so I don’t know where this has come from, but it’s been since I was little) I keep my answers to things at a minimum. I just thought this is how I was with people I’m not really close with (including my family) - id rather talk about them not me. But now im thinking what if I’m so painfully awkward I have no idea how to elaborate, be enthusiastic (depression?) and have a full conversation. I can’t tell stories!!! I stutter and I get nervous, even if it’s a banging story. ( I think no one cares) is it low self esteem or am I socially inept? I can’t trust myself. I want to be witty and funny and NOT awkward with everyone, but I seem so be so painfully reserved I have no idea how. It must just be ingrained in my personality.   For example when someone used to ask me how I was, I knew the polite thing was to ask them back, but I used to feel so awkward and annoying I’d just freeze up. Because why would they want to talk to me about their day? I feel unworthy. ???? On some level   In reality, in my rational, not mentally ill brain, i DONT CARE about being judged. I know people don’t think about my mistakes or even notice them in the same way that I do. But it’s something I cannot shake. And it’s awful. There must be something up.   **i struggle in social situations:**i used to have friends up until recently. I cut them off (or rather we cut each other off as they haven’t reached out since) because I couldn’t get the idea that they hated me out my mind. Every time I met them I felt cripplingly insecure. I stopped being invited to things. We had been friends for about a year prior and I think at some point my brain just snapped? I hated my personality. I felt like everyone was laughing at me. But anyway, I’ve always considered myself a shy person, but not totally socially inept. But now I’m wondering if I am socially inept??? My brain goes blank sometimes, my heart beats fast and I can go red. I speak SO QUIETLY. I’m so unsure of everything I say. I feel embarrassed when I talk. I’m awkward. I listen to other people talk with ease and I’m just in awe. How do they do that? I am good with eye contact but due to OCD (I’ve been told) I am hyper aware of everything I’m doing. I also get intrusive thoughts. Once I realise I’m making eye contact I freak out, think I’m going cross eyed or something. I feel utterly hopeless. I don’t know how to make friends anymore. Did I ever? I’m second guessing every single thing about my personality. I feel unlikable and unnoticeable.   I have a constant inner monologue, which is semi normal as far as I’m aware - but every time I speak I think I overthink. It’s less of a voice telling me everything I say is stupid but more of a feeling. I’m worried I’ve lost all my social capabilities. I can’t trust myself so how would I know? Apparently it’s not as visible on the outside. I seek reassurance (ocd), not too much because it’s really annoying lol but if I’ve just interacted with someone and I’m with my boyfriend, after that’s over I’ll ask him things like “was that ok? Did I sound weird? Did I look weird?”. My family have joked that I have ‘personality dysmorphia’ lol. Is that even possible.   I’m just really scared because I don’t want to be socially inept. I’m seeing something that others don’t as well. I just want to socialise with ease. If I CAN get rid of the anxiety I just get worried about what I’ll say and my mind goes blank. If in the moment I’m ok, afterwards I’ll overanalyse it.   It’s gotten to the point where I don’t even know if I’m not being myself because I don’t know what myself is. I CANNOT trust myself. I just want to skip through the cracks. I’m worried I’ll upset or hurt people if I talk to them too which is slightly irrational. I’ll beat myself up for weird things I’ve done and I’ll remind myself I haven’t even done or said that?????   Also sometimes I feel completely STUCK and unable to say something. And sometimes I’ll think of something to say or want to say something and I’ll think nah that’s stupid or something and someone else will say it out loud and I’m like oh. A sign from the universe that I’m perhaps not as bad as I think? I prefer groups to one on one because there’s less pressure and it’s easier to blend in. I’ll avoid people around college because I’m scared of confrontation. I can’t connect with people anymore (have I ever been able to?) I’m basically worried that I’m really weird because I must be so awkward. Being hyper aware of everything I’m doing is hard. I feel like I look like a new born giraffe when I walk. I can’t connect with anyone I feel.   Is it my mental health (something fixable) or is it something else?     Please help Anyone :)  /r/SocialSkills /r/SocialAnxiety /r/ocd /r/MentalHealth",
      "Post Summary": "There is a subtle adaptive self-state centered around the desire to fit in and feel connected in social situations. This is accompanied by the realization that others don’t notice every mistake, which is an important insight. Additionally, there is a seeking of help from others.\r\n\r\nThe dominant, maladaptive self-state is characterized by rumination, with intrusive thoughts that induce significant anxiety. This is followed by deep self-criticism, feelings of being stuck and unable to communicate, and the perception that others will be detached or unaccepting.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "Please help"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I’m wondering if anyone has any tips or feels the same."
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I know people don’t think about my mistakes or even notice them in the same way that I do"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I just want to socialise with ease."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "My brain goes blank sometimes, my heart beats fast and I can go red."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I CANNOT trust myself."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I couldn’t get the idea that they hated me out my mind"
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "8850837b95",
      "date": "07-05-2019, 23:27:40",
      "post": "What is masking?\nWhat is ***masking*** and how is it different to picking and choosing parts of your personality to bring out depending on the social setting? Eg you’re going to be different at work compared to at the pub? Right?   /r/Aspergers",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 7,
      "post_id": "4091f7e8b8",
      "date": "08-05-2019, 13:49:05",
      "post": "Why do I give short answers?\nWhen asked how I am or how was my day I never really want to say much as I don’t want to be a burden. I’ve done this for so long I also don’t know what to say - I forget my day as soon as I live it. It’s not like someone’s like “did you have a good day” and I’m like blunt af like “yep” I’m polite and all but why don’t I ever expand when asked questions and I usually just turn it back on the other person and they have a lot to say. I feel like a diluted version of myself when I’m not around like one close friend. Even family. Does anyone else do this? Why am I so afraid to talk about myself for longer than like a second. Low self esteem? Or is there something wrong with me?   I want to be able to talk about myself a bit more because that’s how people get to know you. I’m way too closed off? I can’t even help it anymore I just think no one cares lol I feel like it gives off such a weird vibe especially if I have spoken to you more than once lol it’s like I’m hiding something or don’t trust the person (or myself) enough to open up   What is this   /r/Socialskills /r/SocialAnxiety /r/ocd /r/TooAfraidToAsk",
      "Post Summary": "The dominant self-state reflects the writer's difficulty expressing themselves and forming deeper connections in certain social situations. This is accompanied by self-criticism and flight behavior, as evidenced by avoiding answers and redirecting the conversation to others. This is followed by a belief that perhaps no one really cares, along with a tense and anxious affect about feeling \"weird.\"\r\n\r\nA more subtle self-state involves a desire for relatedness, as indicated by the writer's wish to be able to talk about themselves, recognizing that sharing personal thoughts is how people get to know each other.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I want to be able to talk about myself a bit more because that’s how people get to know you."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I feel like it gives off such a weird vibe especially if I have spoken to you more than once lol it’s like I’m hiding something or don’t trust the person (or myself) enough to open up"
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "I usually just turn it back on the other person and they have a lot to say"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Or is there something wrong with me?"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I just think no one cares"
          }
        }
      }
    }
  ],
  "timeline_summary": "The self-states in this timeline appear more stable, with the maladaptive state being dominant. It gives voice to self-criticism and low self-beliefs, accompanied by feelings of loneliness, despair, and a depressed and anxious affect. These elements remain consistent throughout the timeline. The adaptive self-state is more subtle, but it can still be heard. It is characterized by a desire for relatedness and an effort to engage in self-care with the help and advice of others."
}