{
  "timeline_id": "7d9d2e0e0a",
  "posts": [
    {
      "post_index": 1,
      "post_id": "7f22000b69",
      "date": "27-06-2015, 01:13:00",
      "post": "I'm tired of being alone.\nI'm 14. I've been struggling with suicidal thoughts  since the first year of Middle school. I was the weird elitist kid with one elitist friend, then I realized what shitty person I was and became alone. I've always had a love for writing and wrote about my death often in writing tests. I had no friends for two and a half years, my old ones loved to pick on me. In high school it got better and it got terribly worse. I found some friends, one betrayed me, the other told me she self harmed and it destroyed me. Such a happy and kind person.. and finally I started cutting until my mother - who had a terrible childhood and is in psychological therapy since 20 years - found out. I still have scars.  My psychologist and I came to a dead end and I can't muster the strength to go again, I'll curl up into a ball again anyway. I hardly wash myself and pass my days in front of my PC, mainly because I have no social experience whatsoever and have no idea how to chat or hang out. My only hobby is videogaming,'I'm ashamed of it and can't talk about it, the other topics that interest me are \"boring\"  and anyways I'm terrible at talking. And I'm fed up. Every night I stare at my window and wonder what would happen if I ran and jumped. I think about cutting everyday, every fucking second. I can hardly go out without feeling terrible and when I do I think about jumping in the street. I feel the only reason I don't do anything is because my mother would kill herself, which I've been afraid of more than once. The relationship with my father isn't that great too so she's one of the few I trust. I'd say she's my best friend.  I' tired of being the silent, why kid that talks to one guy normally and the rest with anxiety. I'm tired of being scared of physical contact and getting startled by a hug. I'm tired of being unable to find the courage to go out or even wash my hair. I just want to die, since I can't do the most basic things in life.  Sorry for bad english, not a native speaker and on phone.",
      "Post Summary": "The main self state in the post is maladaptive, and centers the writer's expectation that things will not get better for him, with the only solution being his death. this expectation comes from a long period where he felt lonely, with friends behaving in a detached way by picking on him, and even betraying him. it made him feel like he was a shitty person, leading him to feel very depressed, even going as far as cutting himself. The adaptive self-state is comprised of him wishing for an end to his loneliness, and viewing his mother in a favoring light, saying she is his best friend, a close connection which  keeps him from committing suicide.",
      "Well-being": 1,
      "evidence": {
        "adaptive-state": {
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I'd say she's my best friend."
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I'm tired of being alone"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I think about cutting everyday, every fucking second. I can hardly go out without feeling terrible and when I do I think about jumping in the street"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I started cutting"
          },
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "I had no friends for two and a half years, my old ones loved to pick on me. In high school it got better and it got terribly worse. I found some friends, one betrayed me, the other told me she self harmed and it destroyed me"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I realized what shitty person I was and became alone."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "one betrayed me, the other told me she self harmed and it destroyed me"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "My psychologist and I came to a dead end and I can't muster the strength to go again, I'll curl up into a ball again anyway"
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "19d25bdb6b",
      "date": "03-08-2015, 21:51:51",
      "post": "EU4: How do I Ironman?\nI have played a weak 169 hours. I own every DLC (except for graphical/music packs, but w/e) and always strive to play Ironman because I can't help but cheat if I can.  My problem is: in every game I start, I can hardly go on more than 35 years before believing the game is lost and quitting (my maximum was 148-somethingsomething with Tuscany, and was even going pretty well). I then restart as some other random country and it repeats.  I wanted to try a country out of Europe but I lack any kind of interest in them. I'd prefer to fulfill my secret imperialist wishes and commit mass genocide, but usually it is I that gets beaten into a bloody pulp.  So I ask: How do you keep up your interest? How do you restrain from going ALT+F4 at the first loss?  Thanks for reading c: Please point out any errors I've made.",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 3,
      "post_id": "bb5153d82d",
      "date": "11-08-2015, 14:14:32",
      "post": "For Italy, the Emperor, and the Terrible, Terrible Cartographers' Guild\nhttp://imgur.com/gallery/MqvR2lP/ &lt;-- Map link. Syr_Enigma can't into Reddit.  Tuscany into Italy. My first \"Iron\"man run. More like Bronzeman, since I played with easy AI, player bonuses and no lucky nations. :P  The funniest run I've had. Commonwealth PU'd France in 1606, if I recall correctly, and never lost their grip. Attempted a small war to take back part of the Italian region.. I'm lucky PLC loved me. White Peaced out of that suicide run.  Colonized in Brazil, Canada, Oceania and Australia. The first colony acquired most of their wealth and provinces from various wars with Portugal, Spain and England.  Ottomans were beaten to a bloody pulp. What remained of their Kebabiphate was once more ruined by the Particularists. That's what they get for taking Constantinople.  Suez canal was incredibly easy to built. Started it around 1810 and finished it around 1815.. way easier than I thought it would've been. Had three or four events, it was built in the end about 150 days late. Although I never used it.  Planning to convert this to Vic2 as soon as I own it. The Italian Reich has to go on. Hail Emperor Ferdinando IV Rossi!  I'm not sure if it's good or bad though. Try to guess my subjects. Although I don't know if one of them can be guessed. Oh well. Is it a good run, for someone with 215 hours? ^^  P.S. Sadly, the Italian Cartographers' Guild's fundings were cut in order to reach maximum technology. Thus, the few remaining workers couldn't produce the amazing maps seen in the other subreddits. I suck with Gimp.",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 4,
      "post_id": "d628a515dd",
      "date": "17-08-2015, 17:39:02",
      "post": "Testy Test Test. pls is of work",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 5,
      "post_id": "693d5b4017",
      "date": "18-08-2015, 20:28:28",
      "post": "What am I missing?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    }
  ],
  "timeline_summary": "The maladaptive self state in the timeline is characterized by the expectation that things will not get better, with suicide proving to be the only way out. it is very dominant, and extremely maladaptive. that being said, it seems the writer's close connection with his mom, which is very adaptive, serves as a reason for him to postpone his suicide plans, thus keeping the maladaptive voice at bay."
}