{
  "timeline_id": "83997cd4e7",
  "posts": [
    {
      "post_index": 1,
      "post_id": "3e5f44a460",
      "date": "10-07-2019, 01:34:41",
      "post": "Looking for a femdom porn\nI've watched a couple of weeks ago a hentai pornon Xhamster. Now this porn video got deleted and I look for it again. It's titled \"Hentai femdom experiment\" where the Misstress ties, electrectues, whipes, insults etc. the sub to increase his orgasm 300×. I'd be glad if someone could give me title of this hentai",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "3baa369b74",
      "date": "10-07-2019, 02:02:14",
      "post": "20yo vegan goth guy. Round 2",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 3,
      "post_id": "8b14686679",
      "date": "10-07-2019, 02:28:30",
      "post": "Looking for a slave or dom\nHi,   I'm Simon a 20yo guy from Germany. I look for a girl to have some fun with whether as dom or slave. I'm switch so I'm open for both sides.  We can know each other better if you like to first or go right ahead. If you get along fine we might turn this into a deeper level. You can dm me here or on kik  My kinks:  As master: Whipping, Slapping, Binding, Blindfolding, Chocking, Humaliatan, Insults   As slave: Whipping, Slapping, Humiliation, Insults, Strap-on, Pee (Maybe)  I'm looking forward to meet you. Thanks for reading",
      "Post Summary": "An adaptive self-state appears in the post, reflected in his perception of others as connected to him and his belief that he can find someone to enjoy time with. Additionally, his behavior toward others shows a sense of relatedness, as he expresses gratitude to them for reading.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Thanks for reading"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "We can know each other better if you like to first or go right ahead. If you get along fine we might turn this into a deeper level."
          }
        },
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 4,
      "post_id": "ca685ba4c9",
      "date": "11-07-2019, 02:15:50",
      "post": "Ready and tied up",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 5,
      "post_id": "e8b6692482",
      "date": "13-07-2019, 13:59:04",
      "post": "No motivation down af\nI have to redo a whole year of school cuz my school sucks. They told me this 2 weeks ago just out of nowhere. I feel so down and depressed don't know whether I should go to a clinic again to treat my pd and ed or just end it. I don't enjoy reading anymore although I want so. I barely do anything...",
      "Post Summary": "The self-state identified in the post is maladaptive, centered around a lack of motivation and the belief that school is obstructing his autonomy. This leads to depression and a sense of self-criticism, as he feels he is accomplishing very little.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I feel so down and depressed"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I barely do anything..."
          },
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "my school sucks."
          },
          "D": {
            "Category": "(4) Expectation that autonomy needs will not be met",
            "highlighted_evidence": "No motivation down"
          }
        }
      }
    }
  ],
  "timeline_summary": "In this timeline, there appears to be a fluctuation between an adaptive and a maladaptive self-state. In the last post, the fluctuation is noticeable, with the maladaptive self-state being reflected first, followed by an adaptive self-state where he perceives others as connected to him and behaves in a related way toward them. However, in the second post, this adaptive self-state is not evident."
}