{
  "timeline_id": "87821f81b9",
  "posts": [
    {
      "post_index": 1,
      "post_id": "06fd06b8e4",
      "date": "13-12-2019, 11:26:29",
      "post": "20yo vegan goth is back. Destroy me (P.S. I haven't washed my hair since a week)",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "e634f6b440",
      "date": "28-12-2019, 04:56:52",
      "post": "Me 20yo guy and her 35yo girl continue to have 69 after she got a bf and I don't know how to evaluate our situation\nI found a new friend a couple of months, the 35yo girl mentioned above. We were both single at this time and we started to have some fun. We basically did everything besides penetration because she didn't want me to fuck her. Anyway she started to crush on a 35yo dude and who now became her bf. We continue with our plays (including oral) although we agreed on pausing it for the sake of her bf. I was saddened by that fact but I respected her wish and we tried to reduce it. The on Christmas she had a sleep over at my place and we started doing 69 again, which is considered cheating then. She asked me if I want to lick her and I immediately agreed without thinking much about it.  The next day we've talked about it and we will occasionally continue doing these sexual plays (just without penetration), technically it's cheating and I don't know how to evaluate this situation. What do you guys think?  Extra: From an deontological perspective it's despicable what we do, a moral wrong you could say but on the the hand, considering an utilitarian perspective we bove profit from it. We are suffering from PD such as severe depression, and we feel much better after doing it and we can support each other more because of the relive we feel also she is a chronic cheater and she rather cheats with me on her bf the having a ONS with a stranger who doesn't respect her feelings unlike me. Additionally has to be said, that according to her I'm better at pleasing her than her bf.",
      "Post Summary": "There is an adaptive self-state in the post where the individual reflects on his sexual relationship with another woman, recognizing and respecting her wishes. He engages in an inner dialogue about the morality of the relationship, considering that she has a boyfriend. This shows that he is attuned to both his own feelings and the feelings of others, demonstrating self-awareness and moral consideration. He also expresses confidence in his ability to please her while respecting her emotions.\r\n\r\nThe maladaptive self-state, on the other hand, involves self-criticism which in this case may be adaptive to some point.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "I was saddened by that fact"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "we agreed on pausing it for the sake of her bf. I was saddened by that fact but I respected her wish and we tried to reduce it."
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "but on the the hand, considering an utilitarian perspective we bove profit from it. We are suffering from PD such as severe depression, and we feel much better after doing it and we can support each other more because of the relive we feel"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "From an deontological perspective it's despicable what we do, a moral wrong you could say"
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "9e9f3f66b4",
      "date": "29-12-2019, 03:53:00",
      "post": "Waking up at 2am from realistic nightmares.\nI barely have nightmares and if I do I mostly ignore them. If I dream of paranormal activity and my death during those events I can easily ignore it because I'm not superstitious at all and I can explain the reason behind it from a psychological perspective. Today however I woke up from my bullying time that ended over 3 years ago. I've been institutionalized a couple of times now and I'll return to school at January 8th. I'm not afraid of being bullied there at all because my new school has working programs against any kind of harassment which is great. Anyway I got so shocked when I woke up and I burst out into tears and I couldn't stop it. I'm at my friends apartment right now while she's on vacation and I don't have her here to comfort me, specially cause I shouldn't rouse her at this time. Now it's around 5pm I'm overly tired but I can't rest anymore since I woke up from those horrible nightmares. (I had to relive one worse part of my life again in HD and uncensored. I'd call it Simon's bulling time remix.)  I've listened to music, watched some clips to calm me down but I can't manage to rest anymore. Don't know what to do. I just wanted to speak this out for the sake of relieve.",
      "Post Summary": "The dominant adaptive self-state is characterized by self-care behaviors, self-awareness, and an understanding of the self. This is accompanied by the perception that the new school is a safe environment.\r\n\r\nThe maladaptive self-state involves an anxious and tense affect related to the nightmares.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I just wanted to speak this out for the sake of relieve."
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I'm not afraid of being bullied there at all because my new school has working programs against any kind of harassment which is great."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "Anyway I got so shocked when I woke up and I burst out into tears and I couldn't stop it."
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "bb29924563",
      "date": "30-12-2019, 02:19:43",
      "post": "People = Shit",
      "Post Summary": "the self state in the post is maladatptive, and is composed of a detached cognition of others by the writer, as he views people as shit, probably as a result of him being hurt deeply.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "People = Shit"
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "b1c272af81",
      "date": "30-12-2019, 03:34:15",
      "post": "What's the most unusual reason why you ever got dumped\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    }
  ],
  "timeline_summary": "The self-states demonstrated suggest that the adaptive ones are dominant, though both are present to some degree. It is intriguing to explore the aspects of the writer's experience that are not explicitly stated or directly addressed in the posts. Overall, it appears that the writer has multiple self-states and can fluctuate between them."
}