{
  "timeline_id": "8e0a58cfbd",
  "posts": [
    {
      "post_index": 1,
      "post_id": "e1d9b01e68",
      "date": "16-07-2021, 22:05:19",
      "post": "I almost gave my kitten a Disney name but decided on a different name but now I regret it because apparently she loves Disney movies",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "ccef65d7dc",
      "date": "19-07-2021, 09:40:11",
      "post": "Finley the Disney watching kitten strikes again- this time with Frozen. Sorry for the bad lighting I had just turned off the lights in my room.",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 3,
      "post_id": "a0f7385634",
      "date": "21-07-2021, 02:20:54",
      "post": "Someone opened this fried chicken container to take a piece out at Safeway",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 4,
      "post_id": "2ef5b06d92",
      "date": "23-07-2021, 17:25:05",
      "post": "Vets shouldn’t offer declawing. If your a vet then that means you love animals but why would someone who loves animals support declawing. Declawing is awful\nReading about how awful declawing is for your cat is heartbreaking and it blows my mind that these vets who claim they love animals would do something like this just because someone decides to get a cat and not want their furniture scratched. Easy solution - get your cats nails trimmed regularly and you can even buy nail caps for your cats. Trying to find a place for a spay clinic to spay for my kitten who was found in a parking lot and so many of these clinics support declawing it’s so awful. Finally found a place that doesn’t and will spay and has good reviews - it’s $50 more than the other places but I’m glad they don’t declaw.",
      "Post Summary": "The post reveals two distinct self-states:\r\n\r\nAdaptive Self-State: This is characterized by her ability to express her opinions and find solutions, demonstrating behavior oriented towards others. This behavior stems from her belief that others can relate to her feelings on the topic. Additionally, she describes experiencing a positive affect when discovering a place that aligns with her ideology.\r\n\r\nMaladaptive Self-State: This is marked by her perception of others as detached in their treatment of cats. She describes this as \"mind-blowing,\" indicating a tense affect.",
      "Well-being": 9,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(5) Content, happy, joy, hopeful",
            "highlighted_evidence": "I’m glad"
          },
          "B-O": {
            "Category": "(3) Autonomous or adaptive control behavior",
            "highlighted_evidence": "Vets shouldn’t offer declawing"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "Finally found a place that doesn’t and will spay and has good reviews"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "it blows my mind"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "why would someone who loves animals support declawing"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "Trying to find a place for a spay clinic to spay for my kitten who was found in a parking lot and so many of these clinics support declawing it’s so awful."
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "ab71b7b975",
      "date": "28-07-2021, 04:42:34",
      "post": "I wish my parents would get a divorce\nMy mom is constantly in a horrible mood - and then she takes it out on my dad and puts him in a bad mood. He does so much for her- he constantly cooks for her - every meal too. He brings her coffee in bed each day. He will run her errands for take her car to get washed, will do her laundry for her, buys her flowers, takes her on vacations like Hawaii several times in a year and other things and so much more and she rarely says thank you or even nods a bit of appreciation for him. She will demand to take his more expensive car if she doesn’t want to drive her basic car because she feels the need to impress her friends but then complains how much money his truck cost to fill up and how many miles it has on it. She endlessly complains about his dog. She complains about his family and friends but then has no problem hanging with them when they are around. I feel like the only reason they got married is because they had me  accidentally and then my sister accidentally so felt they had to get married since they had two kids together but I truly think they should have never been married. She seems to be in a bad mood almost every night because the littlest things piss her off. Someone could cut her off and she would come home mad and yelling at my dad and at us kids. I wish she wasn’t always so angry and could take anger management classes but if you know my mom you don’t even want to mention how angry she gets because she’ll get angry at you. I’ve been on the other side of her anger - she’s beaten me till I bleed just because she was in a bad mood and took it out on me. I just think my dad would be happier if didn’t have to stay with her.",
      "Post Summary": "The dominant self-state in this post is characterized by her perception of her mother as highly detached and negative, both toward herself and her father. She views her mother as unfair and emotionally distant, leading to expectations of punishment and unmet autonomy needs. She believes her mother’s anger will dominate, resulting in physical punishment for merely bringing up certain topics. Additionally, there is a sense of guilt, as she feels her parents remain together solely for her and her sister’s sake.\r\n\r\nAt the same time, there is a contrasting voice within her that longs for space, autonomy, and a change in the situation.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "I just think my dad would be happier if didn’t have to stay with her"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(12) Ashamed, guilty",
            "highlighted_evidence": "I feel like the only reason they got married is because they had me  accidentally and then my sister accidentally so felt they had to get married"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "she rarely says thank you or even nods a bit of appreciation for him. She will demand to take his more expensive car if she doesn’t want to drive her basic car because she feels the need to impress her friends but then complains how much money his truck cost to fill up and how many miles it has on it. She endlessly complains about his dog. She complains about his family and friends but then has no problem hanging with them when they are around."
          },
          "D": {
            "Category": "(4) Expectation that autonomy needs will not be met",
            "highlighted_evidence": "but if you know my mom you don’t even want to mention how angry she gets because she’ll get angry at you. I’ve been on the other side of her anger - she’s beaten me till I bleed just because she was in a bad mood and took it out on me."
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "2af5e23800",
      "date": "09-08-2021, 04:33:45",
      "post": "Does anyone else want to cry for Mittens from Bolt?\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 7,
      "post_id": "17e3ab4983",
      "date": "13-08-2021, 20:44:05",
      "post": "Am I over reacting? Is it stupid for me to be upset or is it okay for me to be a little upset at my aunt.\n3 years ago my great grandma ( my aunts grandma ) died. Ever since she died I’ve wanted a memorial tattoo for her because we were so close. Talked to each other on the phone twice a week, I went multiple times to see her and didn’t go on other vacations because I wanted to spend time with my grandma. I remember her birthday, sent birthday and Christmas gifts. I sent other little gifts just because and she did the same for me ( of course I never expected gifts in return ) . We were so close. I booked a flight for a Wednesday afternoon to say my final goodbyes and she died Monday so I was two days to late and it tore me to pieces. Anyway I have a birthday card I found the day before my birthday the year she died- it was the perfect angel sign. On it said “ All my love, gram ( and then my grandmas name ) so ever since then I’ve decided I wanted that tattooed I just haven’t gotten it yet because I haven’t found someone where I live and I can’t decide between ankle or wrist. My aunt asked me a while back for my grandmas name in writing because she had really pretty curly cursive writing so I sent her one from a book I had that just said “Love, Grandma ( and then grandmas name ) well earlier this week she text me asking for the photo again. I recently moved so I no longer had that photo but just had a photo of the “All my love “ quote I wanted so I cropped it to just the Gram and my grandmas name. She immediately messaged back asking if it said Love, or anything so I told her what it said without sending a photo and explained how that was what I was getting tattooed on me but I could send her a picture of the whole card and she could piece together Love, Grandma. She replies back she wants the “all my love “ portion too for her tattoo now. I’m irritated because I just told her I wanted that for my tattoo, it has extremely special meaning to me, and to top it all off my aunt constantly acts like she was the best granddaughter to my grandma but when my grandma was still alive she used to always complain the only time my aunt called was when she wanted something , she rarely came and visited her. My cousins all say the same thing about my aunt so it just irks me that right after I mention I am getting it tattooed she ask for the same piece for her tattoo. Part of me wants to tell her to just find her own card that has my grandmas writing. My aunt only seems to text me when she wants something and I know when I was younger she used to make fun of me. I realize now today all this time she acted close to me was always for some benefit for her. Maybe I’m over reacting",
      "Post Summary": "This post reflects two distinct self-states:\r\n\r\nAdaptive Self-State: This is characterized by a desire for validation and connection from others regarding her feelings about the situation with her aunt. She perceives her grandmother as supportive and caring, and her passing evokes feelings of sadness and grief. Additionally, she behaved in a connected and relational way toward her grandmother by talking to her on the phone and visiting her during vacations.\r\n\r\nMaladaptive Self-State: This revolves around her perception of the aunt as punitive and unfair, both in childhood—when the aunt mocked her—and in the present, for taking her tattoo idea. These actions trigger anger in the writer, but she also expresses concern that she might be overreacting. This suggests an effort to protect herself from the possibility that others may not empathize with her situation.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "it tore me to pieces"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "didn’t go on other vacations because I wanted to spend time with my grandma"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "we were so close. Talked to each other on the phone twice a week, I went multiple times to see her and didn’t go on other vacations because I wanted to spend time with my grandma."
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "or is it okay for me to be a little upset at my aunt"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(10) Angry (aggression), disgust, contempt",
            "highlighted_evidence": "I’m irritated"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Am I over reacting? Is it stupid for me to be upset or is it okay for me to be a little upset at my aunt."
          },
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "My aunt only seems to text me when she wants something and I know when I was younger she used to make fun of me. I realize now today all this time she acted close to me was always for some benefit for her."
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "Maybe I’m over reacting"
          }
        }
      }
    },
    {
      "post_index": 8,
      "post_id": "fc48cac7d4",
      "date": "24-08-2021, 00:38:01",
      "post": "Why is it so hard for people to have the common sense to RSVP?\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 9,
      "post_id": "15caaaf01a",
      "date": "30-08-2021, 06:06:22",
      "post": "As cute as she is turning around and seeing this sight is definitely unexpected",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 10,
      "post_id": "38d96d969f",
      "date": "30-08-2021, 15:38:49",
      "post": "What makes someone constantly late? Why is it so hard for them to be on time ?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 11,
      "post_id": "735ce15a00",
      "date": "31-08-2021, 12:32:50",
      "post": "Does anybody in here sew? I have a bunch of fabric I won’t be using that I’d sell for super cheap like $2 or $3 a yard",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 12,
      "post_id": "e61bec2fa8",
      "date": "03-09-2021, 13:45:04",
      "post": "Yes your baby is cute and yes I don’t mind watching him but why the heck am I watching him if he’s sick\nA family friend needed help with her baby. I actually think her baby is cute and I’ve been around him a couple times. I don’t hate babies and kids ( well okay some of them I can’t be around for long ) but I like this baby and the best part is at the end of the day I just get to hand him back to his mom. I was supposed to see the baby all week but he ended up getting RSV. No biggie the mom canceled a couple days ago but now I’m supposed to go hang with him today. According to google RSV is contagious for 3-8 days. He’s only been diagnosed with it 2 or 3 days ago. I feel pressured to not say no but I also don’t want to get sick especially before I go out of town next week. His mom says he’s feeling a lot better so not sure if it’s still contagious or not. I’m just ranting because if it was my kid I would just tell whoever was supposed to watch him today “ hey it’s Friday no point in coming over for just one day this week when my work week is almost over, can we try again a different day next week when he’s feeling better or when you get back from your trip?”",
      "Post Summary": "The dominant self-state appears to reflect a perception of the baby’s mother as detached and untrustworthy. The writer seems to distrust the mother’s judgment, noting that she would have acted differently in the situation. Despite these feelings, the writer behaves submissively, agreeing to see the baby even though he is sick. There is an underlying sense of anger about the situation.\r\n\r\nThe other, more adaptive self-state is characterized by the writer’s perception of herself as a good and helpful person. This self-state is reflected in her engagement in supportive behaviors, such as watching the baby.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I don’t mind watching him"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I don’t hate babies and kids ( well okay some of them I can’t be around for long ) but I like this baby and the best part is at the end of the day I just get to hand him back to his mom."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(10) Angry (aggression), disgust, contempt",
            "highlighted_evidence": "I’m just ranting"
          },
          "B-O": {
            "Category": "(4) Over controlled or controlling behavior",
            "highlighted_evidence": "but why the heck am I watching him if he’s sick"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I’m just ranting because if it was my kid I would just tell whoever was supposed to watch him today “ hey it’s Friday no point in coming over for just one day this week when my work week is almost over, can we try again a different day next week when he’s feeling better or when you get back from your trip?”"
          }
        }
      }
    },
    {
      "post_index": 13,
      "post_id": "25347e7b71",
      "date": "06-09-2021, 12:45:43",
      "post": "Anytime I flush my toilet the water rises and then I just have to let it sit and it goes back down. Any ideas on how to unclog this?\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 14,
      "post_id": "2024ff7e10",
      "date": "07-09-2021, 01:40:25",
      "post": "Why do some people not make enough food when having people over?\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 15,
      "post_id": "6a83b4e29f",
      "date": "07-09-2021, 14:35:11",
      "post": "For those of you who struggle to say no to people how did you overcome it and be more comfortable saying no and standing up for yourself?",
      "Post Summary": "One self-state is characterized by a desire for competence, reflected in the wish to be able to say no. This state also includes self-care behaviors, such as seeking help.\r\n\r\nThe other self-state is marked by self-criticism and low self-confidence, stemming from the inability to say no.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "how did you overcome it"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "how did you overcome it"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "For those of you who struggle to say no to people"
          }
        }
      }
    }
  ],
  "timeline_summary": "In most of the posts, there is both an adaptive self-state and a maladaptive self-state. These states appear to be dynamic within the posts, reflecting a complex perspective. The writer often demonstrates an awareness of what she wants and believes, while simultaneously engaging in self-criticism."
}