{
  "timeline_id": "91b6a42835",
  "posts": [
    {
      "post_index": 1,
      "post_id": "3810882e38",
      "date": "21-01-2016, 14:45:41",
      "post": "Trying one more time to get through FFXIII, and I just have a few questions.\nIs it ever going to be explained why a demigod would do something as stupid as enslaving some humans to do its bidding and then not actually tell them what to do? I feel like there's something I'm supposed to know here, as none of the characters seem as bewildered about this whole thing as I am. Is the fal'Cie actually expecting to get anything done by making such shitty contracts? Are the eidolons aligned with the fal'Cie? And if they come to l'Cie in their greatest time of need, why does the l'Cie then have to prove themselves to it?  I would just like this whole area of the plot to make more sense. Pawns should have some semblance of an incentive to do what they're told as well as some kind of direction if their masters have any desire to get anything accomplished, but l'Cie seem to be in such a hopeless arrangement that they may as well immediately kill themselves.",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "cc15788061",
      "date": "25-01-2016, 17:20:34",
      "post": "Couples of Reddit: How are you radically different from one another, and how do you make it work?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 3,
      "post_id": "2be35f3d79",
      "date": "27-01-2016, 20:56:37",
      "post": "I (M28) am right up to the point of breaking up with her (F26) after 11 months. I'm afraid I'll back out and continue to be unhappy.\nTL:DR; I'm afraid to break up and hurt her, but I'm also afraid I'll let us go on being unhappy.  I don't even really know how to go about this. We basically live together for how much of her stuff she has at my apartment, which is a first in relationships for me. But more than just simple logistics, I don't want to hurt her and I know this would devastate her. I feel weak for how much I don't want to see her cry, but I can't be cold and do anything other than have a thorough talk about it.  I've realized that there's no undermining the happiness that we have had, that the great times will always have been great and it will simply be hard to give up on the chance for more of them together. I've realized that it just isn't worth being unhappy more than we're happy.  This just sucks, I wish it was over with, and I'll need to be thinking of every supportive thing anyone has said to me about this while she probably proceeds to punish the both of us over the decision.  This is something I know is best for both of us, but I'm just so afraid to pull the trigger and I feel pathetic for it. The last thing I want to do is hurt her, but staying together is slowly hurting us both.  Any kind words to help me go through with what I feel I need to do, or any advice for someone new to this on how to execute a breakup when our daily lives and possessions have become so integrated, would be terrific.  Thank you very much.",
      "Post Summary": "This post reflects two self-states, one adaptive and one maladaptive.\r\n\r\nThe adaptive self-state centers on the desire for autonomy in addressing the unhappy relationship. He experiences adaptive grief over the good aspects of the relationship that he now wishes to let go of. His behavior reflects consideration for his partner, as he does not want to hurt them, and he seeks help and advice from others.\r\n\r\nThe maladaptive self-state revolves around anxiety and the expectation that his partner will be hurt by the breakup and may retaliate against his decision. He is self-critical and perceives himself as weak.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "I've realized that there's no undermining the happiness that we have had, that the great times will always have been great and it will simply be hard to give up on the chance for more of them together."
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Any kind words to help me go through with what I feel I need to do, or any advice for someone new to this on how to execute a breakup when our daily lives and possessions have become so integrated, would be terrific.  Thank you very much"
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "Any kind words to help me go through with what I feel I need to do, or any advice for someone new to this on how to execute a breakup when our daily lives and possessions have become so integrated, would be terrific.  Thank you very much"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "but I'm just so afraid to pull the trigger and I feel pathetic for it"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I feel weak for how much I don't want to see her cry"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "This just sucks, I wish it was over with, and I'll need to be thinking of every supportive thing anyone has said to me about this while she probably proceeds to punish the both of us over the decision"
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "25316f14af",
      "date": "29-01-2016, 21:42:18",
      "post": "I've realized that I am insane, virtually unrelatable, alone, and useless. I haven't contemplated ending it this much in a long time.\nThere's nothing I ever say that seems to register to anyone. No one should listen to me. I shouldn't email speak. I shouldn't even think.  All I feel is isolation, pointlessness, and fear. I don't have any ambition or desire. I just feel like I was born into a world with no place for me. Nothing in it that I truly want, and no place in it where I fit.  Just being alive is too hard for me. Every step I bring myself to take is just out of not wanting to hurt my family. Sometimes I wish they would realize that they don't actually need me.   Being alive feels like a trap, and I don't know how much longer I'll be too weak to break out of it.",
      "Post Summary": "A dominant maladaptive self-state is evident, characterized by the expectation of failure and persistent suicidal thoughts about not wanting to exist. There is significant self-criticism, as he describes himself as unrelatable, alone, and useless. He expresses feelings of hopelessness and despair, believing that no one should listen to him or that he shouldn't communicate at all. Additionally, he perceives his family as not understanding and feels they don’t need him.\r\n\r\nThe adaptive self-state is reflected in his decision not to harm himself out of care and concern for his family.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Every step I bring myself to take is just out of not wanting to hurt my family."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "All I feel is isolation, pointlessness, and fear"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "No one should listen to me. I shouldn't email speak. I shouldn't even think."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I haven't contemplated ending it this much in a long time."
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "f4b8b6fe90",
      "date": "02-02-2016, 21:18:28",
      "post": "I don't have a lot going for me, and I care too much about all of it.\nI'm not very smart, not very ambitious, not very manly, not very attractive, not very funny. I just feel obsolete all the time. I know I'm supposed to take comfort that those who are close to me don't care about any of that, but I just can't get over all the ways I don't size up in society. I'm not needed here.  All I'm doing with my life is surviving for the sake of a handful of people who don't want me to die. There just doesn't seem to be a place for me anywhere, because I never feel sufficient.  I want to be recognized for my qualities and feel good about what makes me who I am, but I just don't see any of those things in myself, and it's ground my life to a halt.",
      "Post Summary": "The dominant maladaptive self-state is characterized by a deep sense of worthlessness and the expectation that these feelings will not improve, driven by harsh self-criticism.\r\n\r\nThe adaptive self-state reflects a desire to be recognized for his qualities and to feel good about himself. He acknowledges having close people in his life who continue to support him, regardless of his feelings of worthlessness. Additionally, he shows resilience by striving for the sake of the few people he deeply cares about.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "All I'm doing with my life is surviving for the sake of a handful of people who don't want me to die"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I know I'm supposed to take comfort that those who are close to me don't care about any of that"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I want to be recognized for my qualities and feel good about what makes me who I am"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I care too much about all of it.\nI'm not very smart, not very ambitious, not very manly, not very attractive, not very funny."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I just don't see any of those things in myself, and it's ground my life to a halt."
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "1490e47e89",
      "date": "11-02-2016, 18:05:41",
      "post": "I find myself to be a generally unremarkable person and honestly don't get asked a lot of things. AMA.",
      "Post Summary": "The maladaptive self-state is marked by self-criticism and the acknowledgment that others do not ask him things. However, he simultaneously justifies this by attributing it to his own self-critical tendencies.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I find myself to be a generally unremarkable person"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "don't get asked a lot of things."
          }
        }
      }
    },
    {
      "post_index": 7,
      "post_id": "c61c8e9d6e",
      "date": "19-02-2016, 15:44:37",
      "post": "What makes a fighting game roster both exciting and balanced?\nThe roster is often what decides the success or failure of a fighting game. The characters all need personality, variety, and viability. But what do you think is the best way to ensure any one (or all three) of these things?  What, in theory, makes balance in a roster and viability in each character? What draws you to a character: flavor or mechanics? And if you were in charge of overseeing the roster in a fighting game being developed, what decisions would you make?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 8,
      "post_id": "e539b38c9b",
      "date": "22-02-2016, 18:16:08",
      "post": "What are the weirdest anime to ever get a second season?\nI don't know much, but it seems like the more experimental or off-beat shows don't really take off enough to get continuations. What are some exceptions?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 9,
      "post_id": "e3226b9c15",
      "date": "29-02-2016, 22:11:31",
      "post": "It's my fault I'm barely worth anything to the world.\nI'm pretty much just waiting to die naturally so that when I do, I won't be blamed or resented for it.  There are people who are proud of me, or who admire me, and I've done nothing to deserve it. I'm a fraud. Maybe if I was told all my life that I wasn't gifted or in any way special, the arrogance I've had in order to believe them might have instead been steered towards proving them wrong.  Or maybe I'd have still been too weak to see anything more in myself. Maybe I'd have already ended it by now.  There's nothing about life that's too hard. It's just too hard for me. I'm just a weak person.  If I was forced to do something, anything, with myself, I'd probably have some pride in it. It's my freedom which frightens me into inaction, and my inaction which makes me hate myself.  It's my inaction that makes me invisible to the world around me, less valuable or interesting. I make no difference, and I don't feel the energy required to change it. It's as if there are no actual satisfactory conditions for me. Nothing I truly want. Everything I know and everything I can imagine, every concept is either undesirable or not deairable enough for me to try for it.  Why do I have such strong disbelief in myself? Why isn't there even anything worth trying?  I'd do anything to be in my place in this society, if I just knew where it was.",
      "Post Summary": "A dominant maladaptive self-state is evident, characterized by intense self-criticism. He perceives himself as undeserving of love, sees himself as a fraud, and expresses a desire to die and disappear, reflecting deep depression about his life.\r\n\r\nThe adaptive self-state is characterized by a desire to find his place in the world. He also acknowledges the presence of people who believe in him and take pride in him, offering a contrasting, more positive perspective.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "There are people who are proud of me, or who admire me"
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "I'd do anything to be in my place in this society, if I just knew where it was."
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "It's just too hard for me. I'm just a weak person."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I'm pretty much just waiting to die naturally so that when I do, I won't be blamed or resented for it"
          }
        }
      }
    },
    {
      "post_index": 10,
      "post_id": "2b6647b728",
      "date": "03-03-2016, 09:07:51",
      "post": "I've injured my (neck/back) and cannot even sleep with this pain. What can I do?\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 11,
      "post_id": "28641e5b6d",
      "date": "14-03-2016, 18:29:42",
      "post": "As long as I'm pouring my heart into something, maybe I'm not a waste.\nSomething I heard last night. Maybe it's a better way to think about myself. I'm fixated on my lack of value in society's terms, when perhaps I ought to be looking at the things I create on their own merits, removed from everything else. Maybe this mindset would even help me finish more of the projects I start.  It's probably best that I turn my focus back to therapy and probably medication. It was helping, I think. I've been too sad for too long, and I know I'm the only thing holding myself back from anything. I've tried for years to outsmart it, using logic to try to muscle these feelings out of my head, but the feelings are always stronger. I need help.  I just want to get better. I'm tired of caring whether or not I matter or deserve to be among all these mature and productive people in my life. I just want to be whatever the best me is, and to be truly happy with that.  This line just seemed to encapsulate this mentality. So I just thought I'd write it down for myself, and share it.",
      "Post Summary": "In this post, the dominant adaptive self-state is characterized by a realization that he wants to improve and find his place. He is committed to engaging in self-care behaviors as part of this process, expressing his feelings and thoughts with others, and showing compassion towards himself.\r\n\r\nThe subtle maladaptive self-state reflects self-criticism, particularly regarding his perceived lack of value in societal terms, which he seems fixated on in his situation.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "It's probably best that I turn my focus back to therapy and probably medication."
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "thought I'd write it down for myself, and share it."
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "As long as I'm pouring my heart into something, maybe I'm not a waste.\nSomething I heard last night. Maybe it's a better way to think about myself."
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "I just want to get better. I'm tired of caring whether or not I matter or deserve to be among all these mature and productive people in my life. I just want to be whatever the best me is, and to be truly happy with that"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I'm fixated on my lack of value in society's terms"
          }
        }
      }
    }
  ],
  "timeline_summary": "Throughout most of the timeline, the dominant self state is maladaptive, characterized by feelings of worthlessness and self-criticism, which lead to suicidal thoughts. The adaptive self state is almost always present, but at a lower intensity, until the last post, where it becomes more prominent and takes on a dominant role."
}