{
  "timeline_id": "a35b41d1ca",
  "posts": [
    {
      "post_index": 1,
      "post_id": "fead6ca59c",
      "date": "12-03-2020, 20:29:28",
      "post": "First recovery tattoo",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "b5b5b8896c",
      "date": "29-03-2020, 00:31:56",
      "post": "Never seeing my boyfriend... Am I in a spiral?\nI don't know what to do. My boyfriend is my absolute world and supports me so much with my mental health. I can't see him due to quarantine as we don't live together. Video calls aren't the same and I also can't see my 4 pets that live with him. We both still live with our parents so can't move in.  I'm crying almost every night. Nothing brings me joy. All events and coping mechanisms have been taken aware due to this awful virus and without his support regularly (due to difficult working hours) I feel lost.  Also my job won't let me in due to my mum being high risk and I'm here carer yet I'm a key worker. I feel so useless to this whole situation and just want to disappear.  No one will read this far. I give up... I thought I recovered but hadn't.",
      "Post Summary": "Two self-states are evident:\r\n\r\nThe adaptive self-state involves perceiving herself as capable and recognizing her role as a key worker. She also views her boyfriend as supportive and describes him as her \"absolute world.\"\r\n\r\nThe maladaptive self-state is characterized by self-criticism, feeling useless in the situation, and depression due to not being able to see her boyfriend. These feelings are driven by her desire to recover, but she feels hopeless as this recovery has not been achieved.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I'm here carer yet I'm a key worker"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "My boyfriend is my absolute world and supports me so much with my mental health"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I'm crying almost every night. Nothing brings me joy."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I feel so useless to this whole situation"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "and just want to disappear.  No one will read this far. I give up... I thought I recovered but hadn't."
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "bf8667a104",
      "date": "01-04-2020, 13:50:49",
      "post": "Just been put on Venlafaxine and Quetiapine. What's your experience?\nNothing you say is going to change my plans on doing as my psychologist has adviced but what are your experiences with these medications? Why were you put on them? I've been put on these with no diagnosis, is that normal?  Cheers guys, stay strong and stay safe",
      "Post Summary": "One self-state is adaptive, focused on receiving help from others and gaining a better understanding of her situation and potential outcomes.\r\n\r\nThe other self-state is more subtle, occasionally expressing faint self-criticism, questioning why she needs these medications.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Cheers guys, stay strong and stay safe"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I've been put on these with no diagnosis, is that normal?"
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "555632f15c",
      "date": "01-04-2020, 22:26:06",
      "post": "Am I the only one who records like 10 second clips at a gig and actuallt rewatches them? Hate people who film the whole thing\n[removed]",
      "Post Summary": "This post shows evidence of her attachment to herself and appreciation for the characteristic of recording short clips to revisit later. However, she also expresses a dislike for people who record the entire gig.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Am I the only one who records like 10 second clips at a gig and actuallt rewatches them"
          }
        },
        "maladaptive-state": {
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "Hate people who film the whole thing"
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "9f0d9513f8",
      "date": "03-04-2020, 22:36:29",
      "post": "Coming to terms with my alcohol addiction. Starting 2 new antidepressants and meds to help my hallucinating. Coping working in admin for NHS; no one thanks the ones doing the paperwork or on the front desk :/",
      "Post Summary": "There are two self-states:\r\n\r\nThe maladaptive self-state involves self-criticism regarding her alcohol addiction, along with criticism of others for being detached and not expressing gratitude to the people at the front desk.\r\n\r\nThe adaptive self-state reflects self-compassion and an acknowledgment of her addiction, recognizing that she needs treatment and is coming to terms with it.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Coming to terms with my alcohol addiction."
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Coming to terms with my alcohol addiction"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "no one thanks the ones doing the paperwork or on the front desk"
          }
        }
      }
    }
  ],
  "timeline_summary": "The self-states show slight fluctuations, though they can also remain relatively steady. While much remains unknown for the person, her overall well-being is not in a good place, particularly concerning her mental health. However, she does maintain relationships. The self-states change from post to post, and even within a single post, they can be observed in different ways. On one hand, there are shifts in the elements and, consequently, the self-states, but they tend to have similar characteristics."
}