{
  "timeline_id": "aa310342f5",
  "posts": [
    {
      "post_index": 1,
      "post_id": "c85b76dc59",
      "date": "27-06-2020, 05:04:27",
      "post": "DAE feel like their ability to cry has been completely broken?\nI used to be the type of person who cried all the time. I would burst into tears whenever anything upset me, if I was overwhelmed, if I was hurting and various other reasons.   Over the years I had my parents, friends and SO’s all tell me I had no reason to cry. I would sometimes be gaslighted into thinking that my feelings weren’t valid and I was being “crazy”, “too emotional” or “playing victim”. I had an ex tell me I looked ugly when I cried and look me dead in the face and tell me that crying wouldn’t do anything repeatedly. Something that echoed in my mind as it was something my parents said all the time except they would pair it with “I’ll give you something to cry about”.  I don’t know what changed in me but I just.. stopped. I stopped crying altogether. It’s very hard for me to cry and on the off chance that I do, I don’t like to be seen by others. Which sometimes hurts me in the long term because crying is healthy and a good way to release emotion. I sometimes try to force myself to cry by listening to sad music, reading sad stuff or watching sad shows and nothing.   DAE find their ability to cry has been broken?",
      "Post Summary": "The post reveals two distinct self-states. The first is characterized by a blunted affect, evident in the writer's mention of being unable to cry or feeling that their ability to cry is \"broken.\" This detachment is also noticeable in how they reflect on others' past treatment of them while crying. Additionally, there is a hint of self-criticism and possibly shame, as they express discomfort with being seen by others.\r\n\r\nThe second self-state centers on a desire for connection and relatedness. The writer seeks out people who share similar feelings and engages in self-care behaviors, such as attempting to cry, as a way to release emotions they recognize as being present within them.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "Which sometimes hurts me in the long term because crying is healthy and a good way to release emotion. I sometimes try to force myself to cry by listening to sad music, reading sad stuff or watching sad shows"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "DAE find their ability to cry has been broken?"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(8) Apathic, don’t care, blunted",
            "highlighted_evidence": "and nothing"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "It’s very hard for me to cry and on the off chance that I do, I don’t like to be seen by others."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I would sometimes be gaslighted into thinking that my feelings weren’t valid and I was being “crazy”, “too emotional” or “playing victim”."
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "389430815c",
      "date": "01-07-2020, 05:46:46",
      "post": "Protip: Instead of faking an orgasm to end sex, tell him how much you want him to cum for you.\nI have had several friends tell me that they have faked an orgasm to wrap up sex and I was blown away. I questioned whether or not I was an asshole for not faking an orgasm and then I realized I had come up with a trick of my own.. tell them how much you want them to cum for you (or inside you). 9 times out of 10 it will turn him on further, helping him get to the finish line and therefore ending the sex.",
      "Post Summary": "The first self-state is an adaptive one, characterized by recognizing strengths and feeling competent to offer advice.\r\n\r\nThe other self-state, though more subtle, reflects self-criticism, as seen in a moment of self-doubt and questioning.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Protip"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I questioned whether or not I was an asshole for not faking an orgasm"
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "76d0f361cf",
      "date": "02-07-2020, 04:33:24",
      "post": "I seen my last FP on tinder and I was about to get in my feels but then I caught myself and remembered who the hell I am and that it was their loss.\nMy last FP kept saying how much I meant to him and how he had strong feelings for me but couldn’t be there for me like he wanted to because he was going through his own things. He said he wasn’t ready for a relationship. Which I understood and tried to stay but I couldn’t handle the hot and cold or the one sided effort anymore.   I seen him on tinder and I was about to get in my feels after weeks of feeling fine because I hadn’t been forced to see his face. Then I caught myself and went no. This isn’t how things go. I was there for him on his darkest days, I would come and make him smile when he thought he couldn’t anymore. I made him feel safe enough to show me his demons and open up to me in ways he couldn’t with anyone else. I cheered with him when he succeeded. I was a great force in his life, he would call me his safe space.   I’m a one of a kind person. I fought through hell and back to get to where I am. Choosing to be loving and kind when I wanted nothing but to be cold and cruel. The type of person who makes you laugh when you want to cry but offers a shoulder when you need one. I can guarantee he won’t find another me because we as humans are unique individuals. There’s only one me.  His loss, I hope he finds someone who makes him happy when he is open to giving and receiving love.   I only choose those who choose me and that’s one self love.",
      "Post Summary": "The dominant self-state in this post reflects a perceived sense of confidence and self-assuredness. Also relating behavior towards others is evident in the expressed wish for the FP to find someone who makes him happy. She also perceives others as being able to be related by acknowledging her.\r\n\r\nThe other self-state conveys a feeling of unreciprocated love, accompanied by a strong tendency to suppress feelings and thoughts.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "remembered who the hell I am and that it was their loss."
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "he would call me his safe space"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(10) Angry (aggression), disgust, contempt",
            "highlighted_evidence": "was about to get in my feels but then I caught myself"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "couldn’t be there for me like he wanted to"
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "ea617069e9",
      "date": "06-07-2020, 14:26:47",
      "post": "Anyone else catching my vibe?",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 5,
      "post_id": "61497f55c0",
      "date": "12-07-2020, 16:47:01",
      "post": "I[24] am having issues with ex/baby dad[23M] who continually love bombs me, creates issues and is sleeping with and dating a freshly [18F]\nI \\[24F\\] was with my ex/baby dad Ricky\\[23M\\] for four and a half years. We have a toddler together that we share 50/50. I ended the relationship because over the years after the honeymoon phase ended, he was very cruel to me at times (example: would look me in the face and say he didn't love me and tell me I had no reason try cry when I did), would turn things around on me (example: would offer to hold my credit card so I wouldn't lose it and then tell me \"Well you should carry your own stuff then\" when I was upset he lost it.), had me work to support our family while he played video games and smoked weed with his friends all day, constantly accused me of cheating and had gotten verbally and physically aggressive with not only myself but my friends. (Threw me out of a cab, pushed my best friend twice and purposly burnt her with a ciggarette because she's a lesbian and he was convince we were sleeping together.) It seemed like Ricky was starting to turn around and be better man near the end but it wouldn't last more than a few weeks and I was so mentally drained from the relationship. Everytime I forgave him, I lost more feelings. I had a hard time looking at him the same after he physically assaulted me and my best friend. I left him around 8 months ago.  I started to see a guy Tony\\[24M\\] casually a few months ago and when Ricky found out, he told everyone i was seeing a \"pedophile rapist\" which wasn't true. He told me that I was a \"slimy whore\" and probably had STI's. I avoided my ex as much as I could as I couldn't handle the verbal abuse. Tony and I ended things because I realized I wasn't mentally ready for a relationship after my last one.  Two weeks ago, Ricky and I got into a disagreement because our toddler is still sleeping in a playpen and does not have his own space because Ricky still lives with his mother. We also fought about him leaving our toddler with his mother at all times to hangout with friends. I told him that if he didn't start being a more active parent that I would want to keep my child the 10 days he's working and he can have him the 4 days he's off to spend proper time with him. He stated that he would get his own place and wanted to stay 50/50. When we were speaking about these issues, he kept telling me that he was still in love with me and there was no one he wanted but me. He kept trying to touch me so I got really uncomfortable and told him to stop. I blocked him on everything to get some space.  Recently I realized that our toddler was showing signs of autism so I unblocked Ricky on everything to let him know my concern and let him know when the appointment was so he could attend and we could make up a action plan for our child. Ricky started off with all the things he usually say like \"everyone was ugly compared to me\", \"you have my heart\" and all this other stuff. He also stated that he started sleeping with and seeing Nikki who  was 18 and he liked her but she was \"nothing compared to me\" and he wants me back.  I told him I wasn't interested in getting back together and was horrified by this and the fact he was going on 3 day benders and partying with barely legal girls.  When I told my friend about Nikki, she had her 16 year old brother tell her that this girl was 17 years old. I was went to him about this and he panicked and told me that she was 18. I am not proud of rhis but I absolutely lost my noodle. He went to Nikki and she sent him a picture of her id and he sent it to me to show she was 18. However she JUST turned 18 a month ago. He said that he was mad at me because I probably made it so this girl won't talk to him ever again. He is jumping back and forth between getting mad at me and calling me crazy to hitting on me and saying he loves me. He says are \"equal now\" because I slept with a \"pedophile rapist\" (which reminder, isn't true) so it's okay for him to sleep with a 18 year old.  I feel disgusted and unsure of how to navigate parenting or having a co-parentship with Ricky. While it is not my business who he sleeps with or what he does, it worries me because he is setting a bad example for our child. Technically it is legal for him to see the 18 year old but I feel disgusted. What does a 23 year old have in common with a 18 year old? At 18 you are just starting to experience life and the world. Looking back I realize how weird and almost predatory it was to have guys that age hitting on me when I was so young. I don't want to be with this man but I found myself having a breakdown with all the things that happened in the past few months.   What would be the best course of action to deal with all of this?  (TLDR: I \\[24F\\] dated Ricky \\[23M\\] for 4 and a half years. We have a toddler together. I left him because he was abusive in a multitude of ways. I started seeing Toni \\[24M\\] and Ricky went off about how Tony was a \"pedophile rapist\" which wasn't true so I avoided Ricky. Toni and I ended because I wasn't mentally ready for a relationship. Two weeks ago I met with Ricky to discuss some issues I had with him (my toddler sleeping in a playpen at his house, not having his own space and Ricky leaving our son to hangout with friends a lot) and he kept telling me that he loved me and all girls were ugly except me. He kept trying to kiss and touch me which made me uncomfortable and I told him that and then blocked him. Recently I found out my toddler may have autism and booked an appointment to start the process of getting him tested and I felt it was important for Ricky to be involved. Ricky started his same old \"I love you\" speel and stated he was seeing a 18 year old Nikki. I confided in my friend about Nikki and her 16 year old brother told us that Nikki was 17 years old. I am embarassed to say I lost my noodle and Ricky went to Nikki and asked for a picture of her id. Which he sent to me, Nikki JUST turned 18. He got mad at me for \"ruining\" his relationship with Nikki. He stated we are \"even\" because me sleeping with a \"pedophile rapist\" is equal to sleeping with a 18 year old. However after getting mad, Ricky is flip flopping between telling me he loves me and wants to be back together to being mad I \"ruined his relationship\" with Nikki It is not my business and is technically legal but I feel it is morally wrong and almost predatory for him to be seeing a 18 year old. I also feel that Ricky partying with barely legal girls and going on benders will set a bad example for our child. What would be the best course of action to deal with all of this? How do I manage a co-parentship without the drama?)",
      "Post Summary": "The self-states present in this post include:\r\n\r\nA dominant state characterized by a tense and anxious affect related to her past relationship with Ricky, the father of her child. She is critical of Ricky’s behavior toward her, her friends, and their toddler, and also shows some self-criticism when she asks for the identity of the girl Ricky was with.\r\n\r\nAnother self-state revolves around self-care and caring behaviors, particularly evident in her dedication to caring for her toddler and avoiding harmful situations with Ricky.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "Tony and I ended things because I realized I wasn't mentally ready for a relationship after my last one."
          },
          "B-O": {
            "Category": "(3) Autonomous or adaptive control behavior",
            "highlighted_evidence": "our toddler was showing signs of autism so I unblocked Ricky on everything to let him know my concern and let him know when the appointment was so he could attend and we could make up a action plan for our child."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I feel disgusted and unsure of how to navigate parenting or having a co-parentship with Ricky"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I am not proud of rhis but I absolutely lost my noodle"
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "330a335ec8",
      "date": "12-07-2020, 21:57:08",
      "post": "To the freshly 18 year old girl my baby dad is seeing.\nYou will feel special. You will feel like he’s the one. He will listen to you and what you want in a partner and emulate it. He will make you feel like he’s a dream come true. He will make you feel like this love is like no other. That you are mature for your age to have a 23 year old man wine and dining you. He will tell you how me and his girlfriend before were. Leaving out all the abuse for both of us. He will make us seem like crazy girls and never mention his actions that lead to strong reactions. Once you fall in love, he will stop giving you love. He will tell you he doesn’t know how to love. He will look you in the eyes and tell you he doesn’t love you and when you cry, he will tell you have no reason to cry. He will accuse you of cheating. When he is drunk, he will be cruel and verbally abusive. If the fights get really bad while he’s drunk, he has a history of pushing your friends and throwing you out of a cab or burning someone with a cigarette. The whole time with a thousand miles stare. He will talk shit to his mother every time you break up and act shocked when she hates you. He will make you feel like you’re losing your goddamn mind because of you confront him with anything, he will deny it and if you have proof then he will say you did something to warrant it. By the time you see all the red flags, it’s like quicksand and you’ll struggle to escape.   All this time he’s playing you like a fiddle, he’s calling me to talk about or son and singing “lips of an angel”, trying to tell me I’m his one and only true love and how I am the most beautiful girl he’s ever seen and all the other girls are ugly. When I see him in person, we have to be in public or he tries to touch me.  Telling me he loves me and wishes he could be with me.  He is a manipulative man who only cares about himself. He only got a job and money after I left him. Now he tries to use it to not only get me back but to appeal to new girls.   Run away while you still can, it’s not worth falling down the rabbit hole. I couldn’t imagine going through the things I did when I was a new adult experiencing the adult world for the first time.   I truly feel sorry for you and any other girl that falls into his grasp. I wish you the best.",
      "Post Summary": "This post reveals two distinct self-states:\r\n\r\nOne is characterized by perceiving the other—Ricky—as unfair and manipulative.\r\n\r\nThe other reflects a protective stance, focused on caring for others to prevent them from experiencing the same hurt she did.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(3) Autonomous or adaptive control behavior",
            "highlighted_evidence": "I couldn’t imagine going through the things I did when I was a new adult experiencing the adult world for the first time.   I truly feel sorry for you and any other girl that falls into his grasp. I wish you the best."
          }
        },
        "maladaptive-state": {
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "When he is drunk, he will be cruel and verbally abusive. If the fights get really bad while he’s drunk, he has a history of pushing your friends and throwing you out of a cab or burning someone with a cigarette. The whole time with a thousand miles stare. He will talk shit to his mother every time you break up and act shocked when she hates you. He will make you feel like you’re losing your goddamn mind because of you confront him with anything, he will deny it and if you have proof then he will say you did something to warrant it."
          }
        }
      }
    },
    {
      "post_index": 7,
      "post_id": "174314f2ef",
      "date": "14-07-2020, 06:39:08",
      "post": "Has anyone else experienced their abusive ex to be completely lazy, unhygienic and all around awful until you leave?\nWhen I first got with my ex, he was muscular and cared about his appearance. Over time he stopped caring altogether. All he would do was smoke weed, play video games and hangout with his friends. He gained a bunch of weight, refused to upkeep his hair or facial hair. Dressed like a bum. Never helped with our child or supported us financially. None of it.  But after I left, he suddenly is working a bunch. Gets haircuts and upkeeps his facial hair. Wears cologne. Puts a little more effort into his clothing  and a bunch of other changes.   I feel like I am crazy because I poured all my heart and soul into this man who claimed he was “depressed” or had “post partum” as a excuse to treat me like I was useless and not worth his time. To act like everything I did pissed him off. To tell me he didn’t love me and watched me cry. He was nothing but emotionally, verbally and mentally abusive but I tried my best to help him get to a better mental state in hopes that he would be nicer like in the honeymoon stage after he “got better”.  It just feels unfair that I put so much into this man, and he doesn’t turn around until I’ve left. I don’t know if it’s a facade. It’s hard to not blame myself and feel like I was either used or not enough.",
      "Post Summary": "One self-state is characterized by a perception of herself as compassionate and supportive toward her ex.\r\n\r\nThe other, more maladaptive self-state, involves self-criticism and viewing him as entirely unfair.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I tried my best to help him get to a better mental state in hopes that he would be nicer like in the honeymoon stage after he “got better”"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "It’s hard to not blame myself and feel like I was either used or not enough."
          },
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "It just feels unfair that I put so much into this man"
          }
        }
      }
    },
    {
      "post_index": 8,
      "post_id": "3210af2e2e",
      "date": "28-07-2020, 05:31:15",
      "post": "Someone that used to be the center of my universe and my old FP walked out of my life &amp; I barely even flinched.\nIf you would have told me a year ago that I would have this individual walk out of my life and not have a complete and utter meltdown.. I would have told you that you were lying. She was everything to me for a long period of time. I loved her in every way possible without it being romantic or sexual. She made the rainiest days sunny and felt like a breathe of fresh air when you were choking.   I stopped talking to her in the wintertime and I remembered it felt like my entire world fell apart. I felt lost. I felt confused. I didn’t feel right for a long time afterwards.  We made up a few months ago and it was nice to have her back in my life. However a week ago she decided to delete me off everything without saying anything and blocked my number because she was upset I slept with my ex (who she hates) and besides being irritated about not getting my vape back.. I kind of just accepted that it happened, wished her well mentally and didn’t fight or question her decision. People told me she was posting a lot of pictures and stuff with someone I’m not fond of (almost as if she were showboating) and I just shrugged.  Some friendships just aren’t meant to last and that’s okay. Of course I’ll miss her and that’s okay too. I am so proud of myself for handling it as well as I am without having any animosity or completely losing my shit. This is a huge step forward in distress tolerance. I truly hope she finds nothing but happiness.",
      "Post Summary": "This post reflects two distinct self-states. The dominant state is adaptive, characterized by a positive self-perception regarding the ability to effectively handle the situation. This state is accompanied by a sense of pride and an expectation that her competence needs are being met, viewing her response as a significant step forward in distress tolerance. Additionally, there is a potential, though uncertain, element of prosocial behavior, reflected in wishing her friend well. While this intention is explicit, there is some ambiguity regarding its accuracy.\r\n\r\nThe second self-state revolves around self-criticism, focusing on past behavior characterized by having a complete emotional meltdown. This state is marked by a blunt affect, with minimal grieving or sadness over the loss of a significant friendship. Instead, the perception of the friend appears detached, particularly in response to her action of blocking the user's number.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(11) Proud",
            "highlighted_evidence": "I am so proud of myself"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Of course I’ll miss her and that’s okay too"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "This is a huge step forward in distress tolerance"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(8) Apathic, don’t care, blunted",
            "highlighted_evidence": "I barely even flinched"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "If you would have told me a year ago that I would have this individual walk out of my life and not have a complete and utter meltdown.. I would have told you that you were lying"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "However a week ago she decided to delete me off everything without saying anything and blocked my number because she was upset I slept with my ex (who she hates) and besides being irritated about not getting my vape back"
          }
        }
      }
    },
    {
      "post_index": 9,
      "post_id": "0054479295",
      "date": "29-07-2020, 17:05:28",
      "post": "When I was in the intensive care unit at the hospital for an almost fatal suicide attempt, incoherently calling for my partner.. he was out partying.\nI left this relationship a long time ago and in a lot of ways I have healed and moved on but this.. this is something that scars me to this day.  After a real nasty fight while we were drunk, I tried to kill myself. I was released the next day and in my drugged out state I attempted a second time. This time more serious and I accidentally sent him a voice memo of my mom walking in and shouting and my spaced out voice saying: “I don’t want to be here anymore.” He heard this and was told by my mother that I was in the hospital. He was told that I was having grand maul seizures. He decided it was in his best interest to go out partying instead of making sure that I was okay.   I lost several days of memory. I have no idea what happened those days. I was told by those who were around me and have minor little pieces of memory near the end when I started to become more coherent. I also found the voice memo I accidentally sent. It scares me to this day that I will never know. My mother and grandmother told me that I wouldn’t talk but when I did, I would ask where he was and cry. I would also try to escape and fight hospital staff to find him. No matter how badly he treated me, he was all I thought about.  That’s what truly breaks my heart, my blind love and devotion to a man that broke me. Who was out partying instead of being there for me and said: “Well it’s not like I could have seen you in the hospital anyways.” Or tried to deny that he knew about it. He also tried to say that he tried to take me to the party? Lies on top of lies on top of lies. He partied the whole time I was in the hospital.  There was so much wrong with that relationship. I didn’t try to use my suicide attempt to manipulate him or make him feel bad. After experiencing so much abuse in the relationship for a long period of time, having a undiagnosed mental disorder and harbouring a lot of childhood trauma.. I just snapped and tried to end my life. I was already shakey with my mental health and to have someone gaslight, invalidate me and lie to me every day took its toll. Having him look me dead in the face and tell me he didn’t love me just to make me cry and tell me I was a ugly crier or I had no reason to cry. That’s just the tip of the iceberg. I don’t blame him for my attempt. It was just another factor in a long list of problems.   I didn’t expect anything but to be loved at my darkest hour. Like I loved him. And he wasn’t there for me and it still breaks my heart to this day. I felt so abandoned, lost and alone. When I told him my feelings, he told me I was trying to use my suicide as a manipulative tactic or made me out to be this awful person who tried to ruin his life.   I wish I could say I walked away after that but I didn’t and I deeply regret that. But now? Now I am free. I’m properly medicated. I am in therapy. I am confident in myself and my body again. There is always hope after a bad relationship.",
      "Post Summary": "The dominant self-state in this post is characterized by self-compassion, culminating in the conclusion that she now feels free. This is further supported by self-care behaviors, such as staying properly medicated and attending therapy. Together, these reflect her acknowledgment of a complex but improving sense of self. She feels hopeful and demonstrates a belief that competence and resilience can be achieved, even during very challenging times.\r\n\r\nThe other evident self-state focuses on her perception of others, particularly her ex, as detached. She recalls feeling invalidated by him during critical moments, such as her time in the hospital or when her mental health was fragile. The affect associated with these situations is one of yearning for love and care that she did not receive. Additionally, self-harm behaviors are implied, though not explicitly tied to the same self-state.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(5) Content, happy, joy, hopeful",
            "highlighted_evidence": "There is always hope after a bad relationship."
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I’m properly medicated. I am in therapy."
          },
          "B-O": {
            "Category": "(3) Autonomous or adaptive control behavior",
            "highlighted_evidence": "I don’t blame him for my attempt."
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I am confident in myself and my body again"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": ". There is always hope after a bad relationship"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(14) Feel lonely",
            "highlighted_evidence": "I felt so abandoned, lost and alone"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "an almost fatal suicide attempt"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I wish I could say I walked away after that but I didn’t and I deeply regret that"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "And he wasn’t there for me"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I didn’t expect anything but to be loved at my darkest hour."
          }
        }
      }
    },
    {
      "post_index": 10,
      "post_id": "7bb795083d",
      "date": "30-07-2020, 13:13:27",
      "post": "Does anyone have advice when it comes to “co-parenting” and how to gray rock?\nI share a toddler with my Nex and it’s incredibly frustrating and exhausting to deal with my Nex. He knows exactly how to push my buttons and make me go wild. (Then throw it in my face and blame it on my borderline or tell everyone I am crazy.) I have relapsed a few times (mostly in terms of sex in most recent encounters) but I am determined to staying away from him and trying to build the best life possible for my child.   My Nex leaves our child with his mother when it’s “his week” (we share 50/50) so he can spend all his time partying or with friends. Which is frustrating and heartbreaking that he only spends minutes with his son a day. He treats me like I don’t know what I am talking about when I come to him about things related to our child. I am incredibly close with his family and his mother tells me to never get back together with him and that I am always family so I am supported in that aspect.   How do I “co-parent” with this man? Anyone have some tips to master gray rocking?",
      "Post Summary": "The dominant self-state in this post is characterized by a desire to achieve adaptive control and effectively co-parent with her ex. This is accompanied by self-care behaviors, such as seeking advice on how to improve, and a belief that others can guide her toward better outcomes in this situation. This self-state is motivated by sadness and emotional pain about the challenges she and her child are facing, driving her to engage in self-care and child-focused behaviors.\r\n\r\nThe other self-state is maladaptive, driven by frustration and exhaustion, resulting in a hopeless affect. There is an expectation that her autonomy needs will not be met and that she will fail, influenced by past relapses. Additionally, her perception of her ex is negative, viewing him as detached and treating both her and her child poorly.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "heartbreaking"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "Does anyone have advice when it comes to “co-parenting"
          },
          "B-O": {
            "Category": "(3) Autonomous or adaptive control behavior",
            "highlighted_evidence": "trying to build the best life possible for my child"
          },
          "C-O": {
            "Category": "(3) Perception of the other as facilitating autonomy needs",
            "highlighted_evidence": "I am incredibly close with his family and his mother tells me to never get back together with him and that I am always family so I am supported in that aspect"
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "How do I “co-parent” with this man? Anyone have some tips"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "frustrating and exhausting"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "My Nex leaves our child with his mother when it’s “his week” (we share 50/50) so he can spend all his time partying or with friends. Which is frustrating and heartbreaking that he only spends minutes with his son a day."
          },
          "D": {
            "Category": "(4) Expectation that autonomy needs will not be met",
            "highlighted_evidence": "I have relapsed a few times"
          }
        }
      }
    },
    {
      "post_index": 11,
      "post_id": "c837f6ee99",
      "date": "03-08-2020, 02:59:21",
      "post": "My progress in being less reactive (Losing friend but not my mind)\nA week or so ago, I lost a friend. I made the poor decision of having sex with my ex (who physically abused her and I one night a year ago) so she decided she didn’t want to be my friend anymore. She took me off everything without saying a word.   Normally I would have lost my absolute mind. I would have messaged her and demanded to know why she took me off social media. I would have sat and argued with her over her decision and why it wasn’t unfair. I would have tried to justify my poor decision.  Except I didn’t.  I just respected her decision and didn’t fight it. I didn’t get upset. I didn’t do anything. I could have argued that her being best friends with my abuser means my action was okay. However one thing does not cancel out another. Clearly my decision hurt her and I accept the consequences of that decision. Sleeping with my ex and encouraging his bad behaviour is absolutely wrong in every word of a sense and I make no excuses. The price of shameless sex was the loss of a friend and it’s something I will have to deal with and learn from.   I got an really long, verbally abusive text message from my abuser she’s friends with. It was made clear to me that my now ex friend had told her intimate details about my life. However my abuser took mere grains of truth and twisted it to be unrecognizable.   Normally I would have fed into the drama with my abuser.  I would have confronted my now ex friend for giving my abuser information about me. Demanded to know why she would betray me like this. Start a fight. Raise hell.  Instead I firmly told my abuser to leave me alone. I confronted my ex friend about giving my phone number to my abuser and she denied it. She admitted to giving the abuser info about my child but not the rest of it. I apologized for accusing her of giving my abuser my number and told her there were no hard feelings, I respected her decision and just wanted my stuff back. We exchanged things and that was the end of that. I felt hurt that she spilled some beans but I feel no animosity or hatred.   These don’t seem like a big deal but it’s a huge step forward for me in being less reactive and being more in control with myself and my emotions. It’s a huge step forward to coming to terms with the consequences of my bad decisions. I’m actually accepting things for what they are and learning from them.  I got this.",
      "Post Summary": "The dominant self-state in this post reflects compassionate self-understanding, marked by accepting her mistakes and learning from them. This is accompanied by self-care behaviors, such as remaining calm when disengaging from the abuser and confronting her ex-friend with composure. Additionally, her behavior toward others is characterized by forgiveness and understanding of their actions, with an affect of sadness but no hatred.\r\n\r\nThe other self-state expressed in the post involves self-criticism, particularly when she mentions sleeping with her ex, which she perceives as a poor decision. This state is accompanied by a blunted affect, possibly as a defense mechanism against difficult thoughts. She also perceives her ex-friend and abuser as detached and manipulative, twisting the truth.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "I felt hurt that she spilled some beans but I feel no animosity or hatred."
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I firmly told my abuser to leave me alone. I confronted my ex friend about giving my phone number to my abuser"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I apologized for accusing her of giving my abuser my number and told her there were no hard feelings, I respected her decision and just wanted my stuff back."
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "These don’t seem like a big deal but it’s a huge step forward for me in being less reactive and being more in control with myself and my emotions. It’s a huge step forward to coming to terms with the consequences of my bad decisions. I’m actually accepting things for what they are and learning from them.  I got this."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(8) Apathic, don’t care, blunted",
            "highlighted_evidence": "I didn’t get upset. I didn’t do anything"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Sleeping with my ex and encouraging his bad behaviour is absolutely wrong in every word of a sense and I make no excuses. The price of shameless sex was the loss of a friend and it’s something I will have to deal with"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "It was made clear to me that my now ex friend had told her intimate details about my life. However my abuser took mere grains of truth and twisted it to be unrecognizable."
          }
        }
      }
    },
    {
      "post_index": 12,
      "post_id": "b4e3ae2ef6",
      "date": "03-08-2020, 03:28:28",
      "post": "Lost a friend but didn’t lose my mind.\nOne of my best friends that we will call Allie recently took me off all social media and shut me out after I slept with my ex that she hates (With good reason). A few days, I got a very long verbally abusive text from an ex best friend Vivian that has abused me one and off for years who is friends with Allie. Most of it had grains of truth that were stretched to being lies, many insults and various other things.   I would have lost my mind in the past. Demanded to know why Allie deleted me off everything. I would have argued with her about why her decision was unfair or justify my action of sleeping with my ex. I would have been angry and petty. When Vivian texted me, I would have gotten my feelings hurt and taken it out on Allie. Demanding to know why she gave Vivian all this personal info and betray me like this. It would have been a shit show and a half.   Instead I simply accepted Allie’s decision. Seen the error in my ways and that there are consequences to my actions. I feel hurt she gave Vivian personal information about my life but I am trying to remind myself that I too have spilled beans on people or shit talked when I was angry. I simply stated I had no hard feelings and wanted my stuff back from Allie. Which I truly meant. I firmly told Vivian to leave me alone without reacting. I exchanged belongings with Allie and that was the end of that.  It may not but much but it’s a huge step in radical acceptance and not to react to everything like I normally would.",
      "Post Summary": "The self-states in this post closely resemble those described previously, as the same situation is being recounted.\r\n\r\nThe dominant self-state reflects compassion toward herself, characterized by acceptance and pride in how she handled the situation, while acknowledging and claiming to learn from her mistakes. This is accompanied by a sad affect regarding the circumstances.\r\n\r\nThe other self-state involves self-criticism, which also persists. Additionally, she perceives her friend and her abuser as distorting the truth and devaluing her.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "I feel hurt"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "It may not but much but it’s a huge step in radical acceptance and not to react to everything like I normally would."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(8) Apathic, don’t care, blunted",
            "highlighted_evidence": "Instead I simply accepted Allie’s decision"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Most of it had grains of truth"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "A few days, I got a very long verbally abusive text from an ex best friend Vivian that has abused me one and off for years who is friends with Allie. Most of it had grains of truth that were stretched to being lies, many insults and various other things"
          }
        }
      }
    },
    {
      "post_index": 13,
      "post_id": "a729cecc67",
      "date": "06-08-2020, 17:47:19",
      "post": "ELI5: What is everyone’s new obsession with plants? Is there health benefits or some sort of serotonin rush buying them?\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 14,
      "post_id": "92ff685059",
      "date": "13-08-2020, 02:07:13",
      "post": "My ex/baby daddy[23M] told me that he is officially dating a [18F]\nThe last time he told me that he slept with a girl who was freshly 18, I lost my mind. I told him how gross and inappropriate it was. I went into a full BPD meltdown when I heard she was actually 17 and it turned into a big shit show where she ended up sending a picture of her Id and telling him that she didn’t need the drama in her life.   This time he told me that he is dating a 18 year old. He said that he has been seeing her for 2 weeks but they are 2 days officially dating. (Which is funny because he tried to tell me he loved me like 2 weeks ago and was hitting on me a week ago.)   I simply congratulated him and told him that I hope that he’s happy. Asked that he waits a long time before he introduces her to our child or me. Left it at that.   I don’t find the relationship appropriate at all. However when he told me this, he was dressed like he was 18 himself. Giant stud diamond earrings. Cap turned back. Large wooden rosary with a cross. Just the whole outfit was like a frat boy. He’s been partying everyday and neglecting his duties as a father. He’s simply not ready to grow up so him dating a 18 year old would match his maturity level.   All of these things would normally have sent me into an episode but I have finally reached a place where I accept everything for what it is. Freaking out or making a scene doesn’t do anything but make me look stupid. It doesn’t change the fact he’s dating a 18 year old. It doesn’t mean he’s going to magically grow up. It just shows how right I was to leave.   All I can do is continue to accept things as what they are and find something that’s better for me.",
      "Post Summary": "The dominant self-state reflects pride in her ability to handle situations that would have previously led to a meltdown. She feels independent and has a sense of self-acceptance, enabling her to engage in self-care and adaptive behaviors toward herself and others. This includes asserting control over certain aspects while letting go of others beyond her control.\r\n\r\nThe other self-state involves perceiving her ex as weak, out of control, and unfair in fulfilling his responsibilities as a father. Additionally, there is an underlying sense of fear and self-criticism regarding how she reacted in the past.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(11) Proud",
            "highlighted_evidence": "It just shows how right I was to leave"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "find something that’s better for me."
          },
          "B-O": {
            "Category": "(3) Autonomous or adaptive control behavior",
            "highlighted_evidence": "I simply congratulated him and told him that I hope that he’s happy. Asked that he waits a long time before he introduces her to our child or me"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "All I can do is continue to accept things as what they are"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Freaking out or making a scene doesn’t do anything but make me look stupid"
          },
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "He’s been partying everyday and neglecting his duties as a father."
          }
        }
      }
    },
    {
      "post_index": 15,
      "post_id": "7f6476b28f",
      "date": "15-08-2020, 18:59:56",
      "post": "Help me find this metal painting or something similar to this! I have only seen it in my therapist office years ago and I cannot for the life of me find anything similar.",
      "Post Summary": "The self state in the post is adaptive and is composed of the writer wishing for help from others, and behaving in a relating way by seeking help from others showing his needs.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Help me find this metal painting or something similar to this"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "Help me find this metal painting or something similar to this!"
          }
        },
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 16,
      "post_id": "c50105c731",
      "date": "16-08-2020, 06:48:22",
      "post": "Can you ever truly be free or healed from a narcissistic relationship? Feeling hopeless, alone and suicidal.\n[removed]",
      "Post Summary": "The dominant self-state in this post is characterized by hopelessness and an expectation that competence needs will not be met, leading to the consideration of self-harm as an option.",
      "Well-being": 1,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "Feeling hopeless, alone"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "Can you ever truly be free or healed from a narcissistic relationship"
          }
        }
      }
    },
    {
      "post_index": 17,
      "post_id": "faae49ca72",
      "date": "19-08-2020, 05:05:49",
      "post": "My Nex decided that it was appropriate to verbally abuse me and announce his new relationship with his new supply the same day I find out my there’s high chances my grandmother will die soon.\nMy Nex and I got into an argument this past weekend after I kept trying to get a hold of him for days to discuss our schedules to get our son’s daycare figured out. I said some poor things about his new supply in the heat of the moment which I felt a lot of remorse for. He didn’t care in the slightest but demanded I apologize to her. I already planned on apologizing beforehand and sent something heartfelt. In the apology I mentioned that I understood how it felt because my Nex insulted a guy I was with so it wasn’t fair to her. (Remember this for later)   Today I found out my grandmother will be forced to have a surgery where the survival rate is 40% ane if she does survives there could be plenty of complications. There’s also a 60% she will die during surgery or become a vegetable. I told my groupchat mediated by his mother about it and that I might need support as I deal with it. My Nex decided to call me and coldly said: “Sorry to hear about your grandma” and you could hear him go to talk then hang up abruptly because I was crying.   He then texted me saying how dare I tell his new supply he was viscous towards a guy I had been seeing. He didn’t call to talk about my grandma, he called to get at me. He told me it’s okay for him to insult people I see because they are “facts” (he called the guy I had been seeing a pedo rapist) and it’s completely different then me insulting his new supply.  He never apologized to that poor guy either. He told me I was gross and fucked for “fucking a jailed rapist”, stupid and many other things. I asked him to have some empathy (foolish, I know) as he was supposedly hurt when he lost his grandma and he told me that it’s completely different and not to bring it up. He said his new supply was having a bad day and blocked my number. I had to get his mother to speak to him so I would be unblocked so I can call in case of emergencies (like our son being hurt) or the small occasions we have to talk to co-parent.   Not long after he decided to show his new relationship off to the world like a prized penny.  Completely remorseless for tearing me to shreds or how I was feeling. To further sweeten the blow, he hasn’t spent a single minute with his son. He spends it with his new supply or partying.  I wish I never dated him, he has always been my worst nightmare.",
      "Post Summary": "The dominant self-state is primarily characterized by perceiving her ex as detached, unfair, cruel, and hurtful. She expresses a depressed mood regarding her situation with her ex and her grandmother's medical condition and appears to be seeking empathy.\r\n\r\nA more subtle self-state involves seeking help and engaging in self-care behaviors, though she seems to be looking for support in the wrong places. Additionally, her caring behavior is directed toward her child.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I might need support as I deal with it"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I had to get his mother to speak to him so I would be unblocked so I can call in case of emergencies (like our son being hurt) or the small occasions we have to talk to co-parent."
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "I told my groupchat mediated by his mother about it and that I might need support as I deal with it."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "Completely remorseless for tearing me to shreds or how I was feeling"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "My Nex decided to call me and coldly said: “Sorry to hear about your grandma” and you could hear him go to talk then hang up abruptly because I was crying.   He then texted me saying how dare I tell his new supply he was viscous towards a guy I had been seeing. He didn’t call to talk about my grandma, he called to get at me. He told me it’s okay for him to insult people I see because they are “facts” (he called the guy I had been seeing a pedo rapist) and it’s completely different then me insulting his new supply.  He never apologized to that poor guy either. He told me I was gross and fucked for “fucking a jailed rapist”, stupid and many other things. I asked him to have some empathy (foolish, I know) as he was supposedly hurt when he lost his grandma and he told me that it’s completely different and not to bring it up. He said his new supply was having a bad day and blocked my number."
          }
        }
      }
    },
    {
      "post_index": 18,
      "post_id": "9049f9dbc1",
      "date": "19-08-2020, 06:54:57",
      "post": "If a man treats his mother poorly then he’ll treat you poorly. If he treats his baby mamma poorly then he’ll treat you poorly. If all his exes are all crazy and evil, you’ll be treated poorly.\n[removed]",
      "Post Summary": "The dominant self-state of the writer is maladaptive, characterized by perceiving her ex as detached, unfair, and hurtful.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "If a man treats his mother poorly then he’ll treat you poorly. If he treats his baby mamma poorly then he’ll treat you poorly. If all his exes are all crazy and evil, you’ll be treated poorly"
          }
        }
      }
    }
  ],
  "timeline_summary": "The self-states appear to shift frequently between maladaptive and adaptive. These shifts mainly center on her perception of herself and her ex. When she is able to perceive herself as capable and confident, her behavior and self-state tend to be more adaptive. However, this is often accompanied by a polarized affect, where sadness—an adaptive emotion—coexists with a blunted affect, which is maladaptive and may indicate a defense mechanism. There are frequent transitions between these states, with the maladaptive voice often being dominant, while the adaptive voice remains more subtle and in need of further adjustment."
}