{
  "timeline_id": "c62c65f481",
  "posts": [
    {
      "post_index": 1,
      "post_id": "9a1714671a",
      "date": "24-10-2019, 05:37:43",
      "post": "The only reason I don’t kill myself is because I don’t want to leave my child without a parent.\nHowever sometimes I wonder if it might be better off if I killed myself so I don’t spread all my toxicity to them and ruin them the way my parents ruined me.  It’s hard to say if it’s worse having a dead parent or a mentally ill one.",
      "Post Summary": "The dominant self-state appears maladaptive, characterized by ruminations on suicide, mental illness, and the harm these bring to the child. The writer expresses feelings of shame, self-criticism, and resentment toward their parents, whom they believe failed to meet their needs. There is also an underlying desire for self-destruction.\r\n\r\nA more subtle self-state, barely discernible, seeks to protect the child and prioritize their well-being, or at least minimize the harm they experience.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(3) Autonomous or adaptive control behavior",
            "highlighted_evidence": "I don’t want to leave my child without a parent."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(12) Ashamed, guilty",
            "highlighted_evidence": "It’s hard to say if it’s worse having a dead parent or a mentally ill one."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "all my toxicity"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "my parents ruined me."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "might be better off if I killed myself"
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "4ab055ccc3",
      "date": "03-11-2019, 00:50:54",
      "post": "Is there any difference in how you treat the relationship as them being with a guy vs them being with a girl?\nMy best friend came out as a lesbian, and she has a girlfriend now! I was wondering if the boundaries are any different when it comes to two girls being together vs a guy and a girl.   I know clear boundaries! I try to think to myself: “If it were my partner, how would I feel?” I would never have a sleepover with her girlfriend or undress in front of her etc.   My best friend encouraged me to befriend her girlfriend outside of her so I have been. It just feels like the line gets blurry when it comes to having a friend who is a girl. I don’t want to disrespect my friend and sometimes I feel like there can be a lot more jealousy in their relationship compared to past ones she has had. There have been instances where my friend seems upset with me or has gotten upset with me for doing things that she has done with me and my past ex-partners. For example: saying raunchy jokes around your best friend’s partner.   I’m sorry if this is a stupid question, I just am new to gay dating and so is my friend! I am bisexual as well but I have never been with a girl as of yet so I have no idea when it comes to any of this.",
      "Post Summary": "A dominant self-state emerges in which the writer expresses a desire to understand and support her friend, who is undergoing changes. She appears to seek validation for her thoughts and actions, reflecting a belief that others can provide guidance or help. The writing style conveys energy, and the text reveals a sense of self-acceptance, as seen in her openness about her sexuality and friendships.\r\n\r\nAnother self-state is evident, marked by criticism of her friend, noting actions she claims she would never take in a similar situation. This perspective suggests underlying jealousy regarding her friend’s new circumstances. Additionally, a subtle critical voice appears when she asks for forgiveness for her inquiries, hinting at some self-reproach.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(7) Vigor / energetic",
            "highlighted_evidence": "!"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I know clear boundaries! I try to think to myself: “If it were my partner, how would I feel?”"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "My best friend"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "I just am new to gay dating and so is my friend! I am bisexual as well but I have never been with a girl as of yet so I have no idea when it comes to any of this."
          }
        },
        "maladaptive-state": {
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "I would never have a sleepover with her girlfriend or undress in front of her etc."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I’m sorry if this is a stupid question,"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I feel like there can be a lot more jealousy in their relationship compared to past ones she has had"
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "08fcf6bfdc",
      "date": "04-11-2019, 01:40:14",
      "post": "I keep thinking that if I love people unconditionally that they will love me in return.. but that’s not how it works. Is it?\n[removed]",
      "Post Summary": "The dominant self-state revolves around the expectation that her need for connection will remain unmet, even if she offers unconditional love. This state is accompanied by a perception of others as emotionally detached.\r\n\r\nThe other self-state centers on self-care behaviors and a desire for love, alongside a belief that others may be capable of forming connections and reciprocating her love.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I keep thinking that if I love people unconditionally that they will love me in return"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "Is it"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "Is it?"
          }
        },
        "maladaptive-state": {
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "but that’s not how it works"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "but that’s not how it works."
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "8630dc9d72",
      "date": "04-11-2019, 20:07:56",
      "post": "Do not call me your “fp” and then treat me worst than everyone else in your life.\nMy best friend called me her “fp”. I know that I am not her favorite person, because she treats me the worst out of all her friends and everyone else in her life. I ALSO have BPD and I know I would never treat anyone, especially my “fp” the way that she treats me. This ain’t it.",
      "Post Summary": "The dominant self-state revolves around a desire for connection with her best friend, which remains unmet. She holds the belief that her friend is emotionally detached and treats her poorly, expressing anger when she says, \"Don't call me your FP.\"\r\n\r\nA quieter voice emerges, perceiving herself as a moral person who wouldn't treat her friends in such a way, offering a glimpse into her self-acceptance.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I know I would never treat anyone, especially my “fp” the way that she treats me."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(10) Angry (aggression), disgust, contempt",
            "highlighted_evidence": "Do not call me your “fp”"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "treat me worst than everyone else in your life"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "This ain’t it."
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "2ee1a8cc9b",
      "date": "16-11-2019, 00:53:08",
      "post": "I feel like everyone else has a “person” except for me.\nWhether it’s their boyfriend or girlfriend or even a best friend. It constantly feels like someone else has their own “person” to turn to. It’s weird because I have several friends and I do have a social life but I feel very lonely in a way that I cannot place. I have a child but I refuse to shove adulthood onto a child like my mother did to me.  I’m not sure if this normal. I’m not exactly depressed, I do everything that I need to do and even exercise. I just don’t know how to deal with the loneliness.",
      "Post Summary": "This post reveals two prominent self-states in the writer.\r\n\r\nThe first self-state reflects a recognition of her strengths, such as maintaining a social life and understanding how to care for her child effectively.\r\n\r\nIn contrast, the second self-state is marked by a sense of loneliness and the belief that others share connections and belonging, while she feels excluded. This state is further illustrated by her criticism of her mother and reflections on her own treatment during childhood.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I do everything that I need to do and even exercise"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I refuse to shove adulthood onto a child like my mother did to me"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I have several friends and I do have a social life"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(14) Feel lonely",
            "highlighted_evidence": "I feel like everyone else has a “person” except for me"
          },
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "I refuse to shove adulthood onto a child like my mother did to me."
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "2da7a1893a",
      "date": "16-11-2019, 05:10:28",
      "post": "Euphoria explained midnight mania so well:",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 7,
      "post_id": "4ee43d0000",
      "date": "17-11-2019, 00:47:06",
      "post": "Euphoria portrayed late night mania so well:",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 8,
      "post_id": "eda70d3387",
      "date": "17-11-2019, 22:21:06",
      "post": "F/24/5’3” [155&gt;110](2 Years/24 Months) Went from being a 100 pounds to having a child and gaining a bunch of weight to losing weight through exercise/eating better. Finally starting to feel confident in my body. (Fixed title)",
      "Post Summary": "The self-states demonstrated in the text reveal two aspects.\r\n\r\nOne self-state reflects contentment with the writer’s current situation, as seen in her self-care behaviors like healthy eating and exercise, as well as her self-compassionate thoughts.\r\n\r\nThe other, more subtle self-state, involves past self-criticism, particularly regarding her appearance and weight.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(5) Content, happy, joy, hopeful",
            "highlighted_evidence": "Finally starting to feel confident"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "losing weight through exercise/eating better."
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Finally starting to feel confident in my body"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(12) Ashamed, guilty",
            "highlighted_evidence": "Went from being a 100 pounds to having a child and gaining a bunch of weight"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Went from being a 100 pounds to having a child and gaining a bunch of weight"
          }
        }
      }
    },
    {
      "post_index": 9,
      "post_id": "7c9896a887",
      "date": "25-11-2019, 04:10:18",
      "post": "Stopped taking my antipsychotic because I couldn’t orgasm anymore..\n...and now I can’t stop crying long enough to be to be able to feel even remotely sexually aroused.   I just can’t win.",
      "Post Summary": "The dominant self-state is one of hopelessness, rooted in the belief that she is trapped in an unwinnable situation: she needs antipsychotics to function but cannot feel sexually aroused while taking them. This is evident in her neglectful behaviors, which stem from not taking the medication, along with an expectation that her needs will remain unmet.\r\n\r\nThe other self-state reflects self-care, as she actively tries to improve her situation.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "Stopped taking my antipsychotic because I couldn’t orgasm anymore"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I just can’t win."
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "Stopped taking my antipsychotic because I couldn’t orgasm anymore"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I can’t stop crying long enough to be to be able to feel even remotely sexually aroused"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I just can’t win"
          }
        }
      }
    },
    {
      "post_index": 10,
      "post_id": "e93fe75071",
      "date": "25-11-2019, 20:05:26",
      "post": "Should I [24F] say something to my friend [21F] or just leave it alone?\nMy best friend Julia and I have been good friends for over two years or so. I was there for her during her coming out as a lesbian and every obstacle that came her way, and continually picked her side when my ex would try to be rude towards her or make me cut her off because he was threatened by her. She moved away to another city for a few months in the summertime.  Recently Julia started dating a girl named Alicia. At the time she was still living in a different city and Alicia lived here. Julia encouraged Alicia and I to be best friends too so I started hanging out with Alicia. At first it was hunky dory and I felt really good, I had two best friends that wanted to hangout or Julia would call all the time and it was a good friend group.   Until it wasn’t. Julia ended up moving to our city and everything changed. Suddenly BOTH Julia and Alicia barely talk to me and barely want to hangout. Julia has expressed to me that she’s going through depression so I tried to be forgiving of it and try to understand from a viewpoint of someone who also suffers from mental illness.   However it’s reached a ridiculous point. I have to push for a response from her, and when I am with her she is weirdly passive aggressive towards me (for example: I threw her a huge surprise party and spent over $200 on her and she keeps going off about how I wouldn’t let her do party drugs in my house) and when I talk about my problems she looks annoyed or uninterested. However she can call me crying or go off about her problems for long periods of time where I actively listen and give feedback. I will always do little favours for her and I feel unappreciated. (Example: I was driving her and Alicia to her car and she turned up the music in my car to shut me and her girlfriend up when we were talking. ) It feels like nothing I do is good enough for her.   I understand that there is a honeymoon and sometimes isolation stage with new relationships but I’m not sure if that is the case or if it is depression. She only wants to spend time with her girlfriend. She expressed fears of losing her friends from being with her girlfriend too much but continues to stay distant from me and others. I sort of feel used by both of them and like I was a filler friend until they had each other.   I was wondering if I should ask her if I have done something to bother her to make her act this way or voice my feelings? Or if I should leave it alone?   TLDR: Best friend and I were really close. She moved away but started dating a girl in my city and encouraged us to be friends. As soon as she moved back, her and her girlfriend have barely associated with me. When I do see her, she is passive aggressive and has no interest in my life or problems but will go off about her own. She has expressed that she is depressed but being a supportive friend hasn’t helped, and she is unappreciative when I do things for her. Unsure if she’s stuck in honeymoon stage or just really stuck in her depression. Should ask her if I have done something to bother her to make her act this way or voice my feelings? Or should I leave it alone?",
      "Post Summary": "The first self-state is characterized by the writer’s positive self-perception as a good friend and her sense of self-acceptance in this role. She demonstrates a relational behavior through her willingness to go out of her way for her friends. Despite experiencing emotional pain due to the way she is treated, she legitimizes and somewhat understands her friends' behavior. This self-state also reflects a sense of self-competence, evident in her ability to make friends and support others.\r\n\r\nThe second self-state, which is equally prominent in the text, reflects unmet relational needs. The writer expresses feeling used and perceives her friends as detached, self-focused, and inattentive to her struggles. This self-state is accompanied by feelings of a slight depressed hopelessness, as she feels unappreciated and overly controlled by her friends.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I was there for her during her coming out as a lesbian and every obstacle that came her way"
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "try to understand from a viewpoint of someone who also suffers from mental illness."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "It feels like nothing I do is good enough for her"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I will always do little favours for her and I feel unappreciated"
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "I sort of feel used by both of them and like I was a filler friend until they had each other"
          }
        }
      }
    },
    {
      "post_index": 11,
      "post_id": "2e2ac8100c",
      "date": "26-11-2019, 06:30:12",
      "post": "I feel used and like I was a filler person for my friend who also has BPD.\nI have this best friend who I’ve been friends with for two years. In the beginning, she was everything you could dream of in a friend. She would genuinely care about hearing about me and my day, rush over if I was feeling sad or do little things like run and jump on me with a bunch of gifts for my birthday. We would sing songs together, hangout constantly, workout together and just be thicker than thieves.   Until she found a friend she liked better and potential love interest. Then she went to being cold and everything I did pissed her off. She would be passive aggressive and even aggressive towards me when we lived together. It was an absolute hell. She would be really mean to me and if I voiced my feelings then she would get mad about it.   And then things got better again when that person wasn’t around, it genuinely felt like she was back to caring about me and my feelings. I kept thinking to myself that we could go back to the way things used to be. They never quite got back to the same but it was a start. I thought maybe it was because she was depressed and going through things.   Until she found her SO. Now she’s constantly with her SO and if she does hangout with me then she acts disinterested or annoyed when I talk to her about my problems. Yet she will confide into me about her own and even said she “weirdly is always fighting with her SO when she sees me.” (Ouch, glad you can only find time for me when your SO is pissing you off or you need something). I have continually tried to make birthdays, Christmases and other holidays special for her and pouring my heart, soul and money into her to make things special and in return she focuses on the things I didn’t do for her or things wouldn’t allow her to do in my home. She sometimes makes snide comments about personal situations to me. When I do favours for her, she treats me with disregard. Even recently turning my music in my car up to shut me up when I’m talking when doing her a favour by giving her a ride to her car after a night of drinking where I left her and her SO my liquor the night before. I can do no right with her.  It drives me fucking crazy that I am so bothered by someone who clearly doesn’t feel an emotional connection to me or that I pathetically keep trying to appease her or show her that people do care about her because NOTHING I do is good enough. It doesn’t feel like she cares about me or even cares to have me in her life.   I hate having her as an fp because whenever there’s someone she considers better then she clings to them until it doesn’t workout and THEN she suddenly cares about me. I know I need to stop and let it go and not get to me but it hurts. It hurts more than anything and I’m tired of feeling like I will always come second best. I don’t want her to be my fp and I hate that my shit brain won’t let me detach. I’m tired of hurting over someone who is probably not even giving me a second thought at this very moment.",
      "Post Summary": "The dominant self-state reflects a tense emotional response to the situation with her friend. She feels her friend is detached and indifferent to her needs, leading to an expectation that these relational needs will remain unmet. She expresses that her friend lacks an emotional connection with her and that her efforts to support her friend are never enough. This self-state is also accompanied by self-criticism, as she describes herself as pathetic and overly eager to please.\r\n\r\nThe other self-state highlights the writer’s role as a caring and supportive friend, striving to do what good friends should. She acknowledges knowing what she needs to do to improve her own well-being, demonstrating self-care. Additionally, she allows herself to feel the pain of the situation, which is an important aspect of processing her emotions about the relationship.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "but it hurts"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I know I need to stop and let it go and not get to me"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "She would genuinely care about hearing about me and my day, rush over if I was feeling sad or do little things like run and jump on me with a bunch of gifts for my birthday"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "It drives me fucking crazy"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I pathetically keep trying to appease her"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "Then she went to being cold and everything I did pissed her off."
          },
          "D": {
            "Category": "(2) Expectation that relatedness needs will not be met",
            "highlighted_evidence": "someone who clearly doesn’t feel an emotional connection"
          }
        }
      }
    },
    {
      "post_index": 12,
      "post_id": "90f3b86417",
      "date": "19-12-2019, 22:47:56",
      "post": "For those of you who have suffered from depression, how did you break out of it?",
      "Post Summary": "The main self state is adaptive. it centers the writers wish to feel better through help from others, that makes them ask for advice from the forum on how to break from their suffering. \r\n\r\nThe maladaptive self state is composed of the depressive affect of the writer.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "For those of you who have suffered from depression, how did you break out of it?"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "For those of you who have suffered from depression, how did you break out of it?"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "For those of you who have suffered from depression,"
          }
        }
      }
    }
  ],
  "timeline_summary": "The self-states shift between adaptive and maladaptive over time and throughout the posts.\r\n\r\nOverall, there are elements of self-compassion, engagement in self-care behaviors, and a desire for connection and relatedness. However, these are contrasted by moments of self-criticism, perceptions of others as detached, and a recurring fear that her needs for relatedness will go unmet."
}