{
  "timeline_id": "caee9a5e58",
  "posts": [
    {
      "post_index": 1,
      "post_id": "015a2bb5f3",
      "date": "23-10-2019, 14:25:23",
      "post": "SSRI’s for social anxiety\nHas anyone tried SSRI’s or other medication for social anxiety or OCD Becuase I feel like I’ve literally nearly tried everything and I still feel so inhibited and insecure and off I just want something to work so it’s kind of a last resort kind of thing. I’m thinking it’s very much to do with the chemicals in my brain at this point and I’m getting really disheartened I just want to feel connection.   Everyone else around me insists that I seem fine just a bit shy. I’ve been shy my entire life and I’m sick of it I’m getting too old for this lool. When I socialise one on one I feel it’s worse as I put more pressure on myself; I stop myself from forming real connections and making friends Becuase I’m scared of being rejected and not being interesting / good enough. This entire year I’ve dedicated to building my confidence but there’s just something missing and I feel I should try medication. There’s just a barrier between me and the rest of the world I think lol...a thin one but it exists. I’m just too self conscious and I care too much. I feel like I can’t breath in social situations but I still force myself into them Becuase I know that’ll help with the fear but there’s something missing! Also I speak really softly and it bugs me   If it has helped anyone please let me know or if you’ve found anything else that would work.   Thanks :)",
      "Post Summary": "This post reflects two distinct self-states:\r\n\r\nThe adaptive self-state revolves around her desire to manage her social anxiety and seek effective solutions. There is a sense of hopefulness in her efforts to explore options, such as SSRIs, and evidence of self-care in her decision to force herself into social situations, recognizing that this could be beneficial.\r\n\r\nOn the other hand, the maladaptive self-state is dominated by anxiety, characterized by self-criticism regarding herself and her fear of forming connections. This leads to avoidance behaviors driven by her anxiety.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(5) Content, happy, joy, hopeful",
            "highlighted_evidence": "it’s kind of a last resort kind of thing"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I still force myself into them Becuase I know that’ll help with the fear"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Thanks"
          },
          "D": {
            "Category": "(3) Autonomy and adaptive control",
            "highlighted_evidence": "If it has helped anyone please let me know or if you’ve found anything else that would work."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I’m scared of being rejected and not being interesting / good enough"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I stop myself from forming real connections and making friends Becuase I’m scared of being rejected and not being interesting / good enough"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Also I speak really softly and it bugs me"
          }
        }
      }
    },
    {
      "post_index": 2,
      "post_id": "ffabcd8390",
      "date": "24-10-2019, 10:43:53",
      "post": "How to be more talkative ?\nI want to try and be more outgoing and talkative. I very rarely share anecdotes about my life / day unless I’m certain the other person cares! I’m worried about being boring. Also I think it’s to do with the dominant Fi?   I hang out with people that talk a lot and seem comfortable with it. I’m always the one listening / asking questions since that takes the spotlight off me and I’m anxious about how I come across when I talk for longer than like 10 seconds lol. But I’m worried that also just listening all the time makes me seem really uninteresting and unapproachable / boring to talk to. How can I train myself to WANT to talk about myself and have confidence in my social abilities. Is this an infp thing???   Thanks in advance.",
      "Post Summary": "There are two self-states evident:\r\n\r\nThe adaptive self-state is driven by a desire for competence and self-improvement, particularly in forming deeper connections. This is reflected in self-caring behaviors such as seeking advice, expressing her needs, and showing gratitude toward others.\r\n\r\nThe maladaptive self-state is characterized by self-criticism in these situations and anxiety about being perceived as boring or uninteresting.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "How can I train myself to WANT to talk about myself and have confidence in my social abilities. Is this an infp thing???"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Thanks in advance"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I want to try and be more outgoing and talkative."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I’m anxious about how I come across when I talk for longer than like 10 seconds"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "But I’m worried that also just listening all the time makes me seem really uninteresting and unapproachable / boring to talk to"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I very rarely share anecdotes about my life / day unless I’m certain the other person cares!"
          }
        }
      }
    },
    {
      "post_index": 3,
      "post_id": "51965dd605",
      "date": "26-10-2019, 17:04:58",
      "post": "How do I stop being ‘too nice’\nBeen like this forever. A defence mechanism?  I work in customer service (hate it Becuase I’m painfully shy and quiet but I’m trying so if anyone has any other tips on that) and I know it’s normal (please let me know if it’s not lol) to have a ‘customer personality’ like when you’re Uber nice when you’re serving people etc but at work I feel soooo inhibited and unable to be myself. My ‘customer service personality’ and politeness translates into how I am with coworkers etc. It’s so frustrating I feel unable to be myself. I’ve always been shy and reserved my entire life and I’m really trying to break that cycle of things and show my true personality. I think it’s like people pleasing? If I don’t know someone well enough (like super well) I’m really inhibited and polite and like oooh sorry ooh. It’s so annoying bc no one likes that. I’m not a suck up at all, just elements of people pleasing (although I couldn’t care less if they liked me???) I also find it hard to make real friends Becuase I have such a barrier of like politeness I can’t show me true self and connect. People like me, but they don’t know me. :(  I used to think I had like an inferiority complex type thing? I was scared of authority actively as a child, I wouldn’t talk to my teachers (ages like 4-8). If anyone can tell me what the fuck my problem is and how to stop it and stop giving a fuck what people think and embrace myself and stop feeling shy I will literally give you my first born child. How do I stop being ‘too nice’?",
      "Post Summary": "The adaptive self-state is primarily characterized by her desire to improve and seek help. There is evidence of self-caring behavior and a recognition that others may potentially facilitate her needs. Her strong motivation to succeed in improving herself is evident. Additionally, she demonstrates relatedness and politeness toward others, though it is uncertain to what extent this is adaptive.\r\n\r\nThe maladaptive self-state is marked by an anxious affect and significant self-criticism. She feels unable to reveal her true self, which may reflect a perception that others are incapable of understanding her.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I’m really trying to break that cycle of things and show my true personality"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "How do I stop being ‘too nice’?"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I was scared of authority actively as a child, I wouldn’t talk to my teachers (ages like 4-8)."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "It’s so annoying bc no one likes that."
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "People like me, but they don’t know me."
          }
        }
      }
    },
    {
      "post_index": 4,
      "post_id": "56b56d5d5b",
      "date": "19-11-2019, 13:35:18",
      "post": "Why am I so ‘picky’? What’s my problem?\nI’m a 19yo INFP female. I’ve spent this year trying to figure myself and my life out. I cut off all my shitty friends last year and have been pretty much alone ever since. I’m very shy and socially anxious (always been shy) so i find hard it to socialise and make friends.   I had a solid group of girl friends from about 7 - 14. We were all super close and there were about 7/8 of us. I cut them off at 14 bc of typical girl drama and they were actively leaving out one of the girls I was close to.   Since then I just hung out with my best, closest friend (the one previously being left out) and it was just us and we did everything together. Around like 15 when we all had exams and stuff she went kind off hermit mode on me (and everyone else) and we stopped meeting / talking as much and started focusing solely on school. So that got kind of lonely!!   About a year and a half later when my friend was still kind of hermit mode I ‘joined’ this other group of friends. They weren’t really ‘my type’ of people and it was sort of just superficial for all involved for the most part. I was looking through some old messages today (my memory is atrocious) and I realised how much I truly hated hanging out with them. I felt so out of place but I was so lonely and felt like I had no other option. We basically just did drugs and drank together so I could tolerate it for the most part. But they all seemed to get along sober too? I felt too shy and awkward to meet them when I was sober ???? What was wrong with me? Why couldn’t I just get along with these people like they did each other???   Basically fast forward a few years and I’ve never really been able to form another connection that I deem ‘adequate’ or ‘deep’ enough to consider a friend, since the breakdown of the original friendship group and then my best friend. A true friend. Am I too picky or is something wrong with me? I’ve had people call me their friend, and I don’t really feel the same. I’m so confused. Looking back and realising how much I felt I didn’t fit in with that group I was with for nearly two years really hit me. How much of a bitter loner I was, I used to say their humour didn’t fit mine, their values etc. How do you look past the differences and connect regardless?   I stopped being friends with them because my mental health got so bad, I thought everyone hated me.   Can someone please help me. I’m terrified that I’ll be this way forever. Sorry this isn’t that coherent. What if I never connect with anyone again? Why don’t I deem any relationship or person ‘good enough’ to pursue?",
      "Post Summary": "There are two self-states evident:\r\n\r\nThe adaptive self-state centers on a desire for self-improvement, motivating her to engage in self-betterment behaviors and seek help from others.\r\n\r\nThe maladaptive self-state is characterized by a sense of hopelessness, with the expectation that she will not be able to establish meaningful communication. This state is accompanied by anxiety and intense self-criticism.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I’ve spent this year trying to figure myself and my life out."
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Can someone please help me"
          },
          "C-O": {
            "Category": "(1) Perception of the other as related",
            "highlighted_evidence": "Since then I just hung out with my best, closest friend (the one previously being left out) and it was just us and we did everything together"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I’m very shy and socially anxious (always been shy) so i find hard it to socialise and make friends."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Why am I so ‘picky’? What’s my problem?"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "I cut off all my shitty friends last year and have been pretty much alone ever since."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "What if I never connect with anyone again? Why don’t I deem any relationship or person ‘good enough’ to pursue?"
          }
        }
      }
    },
    {
      "post_index": 5,
      "post_id": "5ff946ee4b",
      "date": "19-11-2019, 20:56:03",
      "post": "How do you even know if you’re masking?\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 6,
      "post_id": "2d8566a5f8",
      "date": "20-11-2019, 00:41:03",
      "post": "Why have I always felt suicidal on some level? Is it normal\nI wish you could opt out of life. I’ve been suicidal for years but it comes and goes. On a fundamental level I feel passively suicidal a lot. Like all the time. Is this not normal? Why is this? I’ve looked into being euthanised, I would pay someone to murder me as I don’t want it to look like I’ve killed myself because I don’t want to upset anyone. I’ve wanted to opt out ever since I found out that life is like forever......until you die. I don’t want to live in this society. I feel like my life is wasted. It hurts. I’m young right now. Twenty soon. But as I’ve gotten older the thoughts and feelings just get more intense. I’m scared of pain though, not death. I also don’t want to try and fail. But if there was a switch, I’d do it no hesitation. And if there was a way I could not upset my family in the process.   I feel like I was born sad? Is that a thing. Nothing particularly bad has ever happened to me in my opinion, but I’ve just always wanted to not live. However now I just want to die, I’m very suicidal. I can’t even move.  It’s like I can’t even look back at a time where I wasn’t suicidal so I can’t think oh it’ll pass! I’ll be fine soon! It’s like as soon as I had some comprehension of it - I’ve been in some way shape or form suicidal!",
      "Post Summary": "The dominant maladaptive self-state revolves around a strong desire to die. She appears deeply depressed and hopeless about her life, expressing that she cannot recall the last time she wasn’t suicidal.\r\n\r\nThe adaptive self-state reflects care and concern for others, such as her family, as she mentions not wanting to hurt them by committing suicide.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "I don’t want to upset anyone"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "Why have I always felt suicidal on some level? Is it normal\nI wish you could opt out of life."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I feel like my life is wasted. It hurts."
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "However now I just want to die, I’m very suicidal."
          }
        }
      }
    },
    {
      "post_index": 7,
      "post_id": "e5038c1910",
      "date": "20-11-2019, 01:03:01",
      "post": "Does my personality type make me suicidal?\nDoes being an infp make me more prone to being suicidal and having bad mental health? Ever since I knew that life was like permanent I’ve wanted to opt out. It’s not for me. I feel suicidal on a fundamental level, almost permanently, no matter the circumstances, and I’ve tried many different types of therapy.   Anyway, help me.",
      "Post Summary": "The dominant self-state revolves around persistent suicidal thoughts, which she describes as nearly constant and fundamental. She mentions having tried various types of therapy, yet continues to experience these feelings. The prevailing affect is one of hopelessness.\r\n\r\nThe adaptive self-state centers on behaviors aimed at self-improvement, such as engaging in therapy and seeking help from others.",
      "Well-being": 2,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I’ve tried many different types of therapy"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "help me"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "Ever since I knew that life was like permanent I’ve wanted to opt out. It’s not for me"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I feel suicidal on a fundamental level, almost permanently, no matter the circumstances, and I’ve tried many different types of therapy."
          }
        }
      }
    },
    {
      "post_index": 8,
      "post_id": "d7534e56f9",
      "date": "20-11-2019, 11:59:11",
      "post": "Is this a normal child hood phase?\nHey guys! When I was younger I went through a phase of being really into ‘detailed’ planning. I want to say I was like nine. No one really thought it was odd at the time but it kind of bugs me looking back and I wonder if it’s indicative of something else.   If I was going out with friends I would write down like wake up: 9am, get dressed: 9:05am, brush teeth: 9:15am.....leave house: 10am, walk to ____ 10:10am etc etc you get the picture.   Is this kind of odd for a young kid? Or is it a normal ‘phase’?   Let me know! I’d be interested to hear if anyone else experienced this lol",
      "Post Summary": "There is a maladaptive self-state characterized by criticism of her childhood behavior and questioning whether it indicates something deeper.\r\n\r\nThe adaptive self-state involves seeking help from others.",
      "Well-being": 5,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "is it a normal ‘phase’?   Let me know! I’d be interested to hear if anyone else experienced this lol"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "When I was younger I went through a phase of being really into ‘detailed’ planning. I want to say I was like nine. No one really thought it was odd at the time but it kind of bugs me looking back and I wonder if it’s indicative of something else."
          }
        }
      }
    },
    {
      "post_index": 9,
      "post_id": "db9285b982",
      "date": "25-11-2019, 22:15:35",
      "post": "Zero hour contract ‘notice period’?\nHi guys.   I’ve been having some problems at work that have led to me wanting to quit outright. I work zero hour contract and usually 2 days a week, therefore a notice period isn’t required but I have been told that two weeks is ‘ideal’. I really do not want to work this as it is 1. Not required and secondly because of the circumstances in which I have decided to leave.   How do I make this clear in my resignation letter? I am very nervous about this as I’m worried I’ll be expected to and I find it hard to say no. I really want to stand up for myself and say no because the entire reason I’m leaving is so I can start valuing myself, my skills and my time. What’s the common etiquette for resignation letters/ how do I say I won’t be working my ‘notice’ and how do I avoid the awkwardness of being questioned about it?   Thanks guys",
      "Post Summary": "There are two self-states:\r\n\r\nThe adaptive self-state revolves around seeking self-help from others and engaging in self-care behaviors, driven by a desire to start valuing herself, her skills, and her time.\r\n\r\nThe maladaptive self-state centers on the expectation that she may not succeed in setting boundaries, as she struggles to say no. This is accompanied by nervousness and a desire to avoid the situation.",
      "Well-being": 4,
      "evidence": {
        "adaptive-state": {
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I really want to stand up for myself and say no because the entire reason I’m leaving is so I can start valuing myself, my skills and my time."
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Thanks guys"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "I’ve been having some problems at work that have led to me wanting to quit"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I am very nervous about this as I’m worried I’ll be expected to and I find it hard to say no"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "how do I avoid the awkwardness of being questioned about it?"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I am very nervous about this as I’m worried I’ll be expected to and I find it hard to say no."
          }
        }
      }
    },
    {
      "post_index": 10,
      "post_id": "8ead1e1650",
      "date": "17-12-2019, 17:05:10",
      "post": "Is it normal to lay in bed all day\nOver the past four years I have been quite depressed. Lately I feel slightly better though, lately as in the past week. I can get very depressed and suicidal and spend days and weeks in bed rotting. Occasionally I can come out of that funk tho. I don’t consider myself that depressed....just hormonal...? And fed up with life.   But anyway, I tend to spend random days in bed when I have not much to do. Today I’ve been sleeping on and off all day and eaten like crap. I peeled myself off the bed 30 mins ago and I feel awful. Is this ok though? I don’t know how to stop? I consider myself lazy ???? Like I don’t have any hobbies, I’m not sure what else I’d do? I think I’m vitamin d deficient.   Any feedback or insight would be appreciated. Thanks everyone",
      "Post Summary": "One adaptive self-state involves seeking help from others and occasionally perceiving herself as capable of breaking free from depression. She doesn't fully consider herself depressed and speculates that it might be hormonal, which reflects some self-compassion. This state is driven by a desire to improve and a belief in her ability to do so, as seen in her statement that the past week was better in this regard.\r\n\r\nThe maladaptive self-state revolves around avoidance and neglect, such as spending days lying in bed. She is self-critical, viewing herself as lazy and lacking hobbies. These behaviors are linked to the depression she experiences.",
      "Well-being": 3,
      "evidence": {
        "adaptive-state": {
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "Any feedback or insight would be appreciated. Thanks everyone"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Occasionally I can come out of that funk tho"
          },
          "D": {
            "Category": "(5) Competence, self esteem, self-care",
            "highlighted_evidence": "Lately I feel slightly better though, lately as in the past week."
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(4) Depressed, despair, hopeless",
            "highlighted_evidence": "I can get very depressed and suicidal and spend days and weeks in bed rotting"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "I tend to spend random days in bed when I have not much to do. Today I’ve been sleeping on and off all day and eaten like crap."
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "I consider myself lazy ???? Like I don’t have any hobbies, I’m not sure what else I’d do?"
          }
        }
      }
    }
  ],
  "timeline_summary": "The self-states appear to fluctuate slightly, with the maladaptive self-state being dominant most of the time. While the maladaptive state may change, it tends to maintain similar elements. The adaptive self-state, though also subject to some fluctuation between posts, is generally more subtle than the maladaptive state. The elements within the adaptive self-state show considerable similarity, both within individual posts and across them."
}