{
  "timeline_id": "feb7900b62",
  "posts": [
    {
      "post_index": 1,
      "post_id": "398b220dad",
      "date": "01-12-2019, 00:00:57",
      "post": "What if our organs went on strike\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 2,
      "post_id": "4c357eb93f",
      "date": "03-12-2019, 12:52:28",
      "post": "When you lose that one thing you always have but never need but then you need it but it’s lost\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 3,
      "post_id": "5070f72723",
      "date": "06-12-2019, 01:04:33",
      "post": "What if I turned my dick inside out and sprayed piss in this cone of piss\nWhat",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 4,
      "post_id": "2f6fc533f1",
      "date": "09-12-2019, 10:49:48",
      "post": "“Just stop worrying about it”\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 5,
      "post_id": "66a6a9729d",
      "date": "09-12-2019, 10:50:01",
      "post": "Stab the annoying kid in his eye with my pencil and slam his head on the desk",
      "Post Summary": "The self state in the post is maladaptive, composed of detached cognition of another kid, showing the writer dislikes that kid and has aggressive tendencies towards him.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "Stab the annoying kid in his eye with my pencil and slam his head on the desk"
          }
        }
      }
    },
    {
      "post_index": 6,
      "post_id": "98a7f54367",
      "date": "09-12-2019, 10:50:07",
      "post": "What if I killed myself during my math class presentation",
      "Post Summary": "the self state in the post is maladaptive, composed of a contemplation about suicide, showing a self defeating thought process.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "What if I killed myself during my math class presentation"
          }
        }
      }
    },
    {
      "post_index": 7,
      "post_id": "ddff2f2612",
      "date": "10-12-2019, 10:27:18",
      "post": "By far the weirdest\nScorpion from mortal combat uses his chain to rip the brain from an infant onto a grill and then puts it in a burger to feed it to a customer",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 8,
      "post_id": "69d3ab6672",
      "date": "14-12-2019, 12:28:54",
      "post": "Cum Jar",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 9,
      "post_id": "16eb60c3fb",
      "date": "15-12-2019, 23:30:31",
      "post": "OwO hitwer what awe u dowing",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 10,
      "post_id": "33b78a5d3c",
      "date": "16-12-2019, 11:02:40",
      "post": "MASON GANG\nMason&gt;Jason",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 11,
      "post_id": "9f369cb36f",
      "date": "17-12-2019, 13:46:39",
      "post": "I am shook still\nIt’s been a while since but this morning I had the worst nightmare I’ve ever had, first nightmare to actually make me scared after being woken up, I had a disease of some sort and had to slowly die in front of my friends and family, knowing throughout that day it was my last day alive, I collapsed on my knees in the middle of the school day vomited and my vision started to fade black, I said one last thing, “I love you all” or something like that I don’t exactly remember but this nightmare hit exactly where it hurts, I get super anxious over my own death and afterlife and blah blah I just freak the fuck out.",
      "Post Summary": "The self state in the post is maladaptive. it's composed of anxiousness the writer felt following a bad nightmare. the anxiousness aligns with the theme of the anxiousness they experience in their daily life, as they fear death and the lack of autonomy associated with it.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I had the worst nightmare I’ve ever had, first nightmare to actually make me scared after being woken up,"
          },
          "D": {
            "Category": "(4) Expectation that autonomy needs will not be met",
            "highlighted_evidence": "I get super anxious over my own death and afterlife and blah blah I just freak the fuck out."
          }
        }
      }
    },
    {
      "post_index": 12,
      "post_id": "61cf4e61a9",
      "date": "20-12-2019, 01:08:21",
      "post": "Almost killed someone today in class\n[removed]",
      "Post Summary": "the self state in the post is maladaptive, it's composed of the writer feelings aggressively angry, hating someone viewing them as detached.",
      "Well-being": 8,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "A": {
            "Category": "(10) Angry (aggression), disgust, contempt",
            "highlighted_evidence": "Almost killed someone today in class"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "Almost killed someone today in class"
          }
        }
      }
    },
    {
      "post_index": 13,
      "post_id": "79c854a909",
      "date": "24-12-2019, 14:07:38",
      "post": "To the people who want adhd/anxiety\n[removed]",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 14,
      "post_id": "7933983a4a",
      "date": "27-12-2019, 15:21:52",
      "post": "Serious, Seriously: Help\nI have both adhd and anxiety but this post will be mainly about anxiety   So my anxiety is starting to go off the walls with shit now, since me and my small group of friends are on a tight rope because of my shit I do, I’m super stressed and devastated that it’s gotten to this point, I’m ashamed and sad beyond measurement, I am usually open to share my opinion (keep in mind I’m a highly logical straightforward person, but with an open sense of humor, but when stuff gets serious I’m super logical and straightforward to the point that it’s THE way or no way kinda deal) and when I share my opinion all of my friends have drastically different views and often make fun of me and disrespect me for my logical viewpoint (and that I live in a highly democratic state and I’m a bit of a republican but enough politics for now) and since I’m republican I don’t want them to know in case they turn me into a social outcast because they are all super democratic people, my anxiety takes over and it starts with thoughts like “what if they know (insert highly secretive secret I’ve been hiding that could ruin my entire reputation in the school and ruin my friendship with all at this school)  My anxiety is making me feel like I’m being used by them like a puppet, stuff and thoughts like “they only like you because you’re funny and know science and history really well so they can get answers” and now that I think about it, my best friend does seem toxic, now that my perspective is skewed with the negativity, I can’t not see it that way,  he never truly listens to me, everyone talks to me like a child, I’m the class clown so how could I be having any problems in life right? My life is clearly hilarious and nothing could go wrong! I wish that was true, none of my friends understand and I’m not trying to sound like an edgy teen “No one understands me!” For attention I’m actually serious when I say they do not understand me or maddening struggle just to get up everyday and be alive, not once have they listened to me about it, only one time has one of them listened, it was when I slapped him hard and told him to shut the fuck up and listen, he was rambling about me and shit and I snapped and slapped him cutting him off and told him about how my life is crumbling and he didn’t even try to understand, the only way I got him to listen was assault, I’m beyond disappointed. I can’t do this shit anymore, I’m going to snap soon from this stress and stuff, my friend never shifts his perspective to mine, I’ve told him about my adhd and anxiety and my persistent lack of sleep and how it’s ruining my life and he never listens or tries to understand, he’s ignorant and irritating when I talk serious to him, I cannot fucking stand it, there’s no one to talk to about this serious shit except him and if I do it to anyone else I’ll get sent to a fucking mental institute because they’ll misunderstand and call the fucking cops because of what I told them about what was happening in my fucked up head. I’m not gonna say what goes on in my head because it’s uncomfortable to talk about and I will probably be called a faker and shit like that, most subreddit dwellers are ignorant and selfish (except you lovely fellows and a few other subs, other than those no one will ever look from another POV and are insanely ignorant)  I’m scared that everything is gonna fall apart and before I know it I’m gonna be hanging from my own ceiling from not being able to handle this anymore.  Thank you for reading, I needed to vent, I don’t really need any support in the comments but I don’t mind, I just needed to tell someone even anonymously would work.  If a single one of you criticizes anything in this I want you to think about what damage you’ve caused and how much that may hurt, don’t be ignorant and spread hate, don’t leave hate just leave, spread love and care and avoid things you don’t like, don’t be an idiot",
      "Post Summary": "The main self state in the post is maladaptive and centers the writer's expectation that he will not be able to cope with his situation a lot longer, feeling his competence needs will not be met. it makes him feel very anxious, and coupled with his lack of sleep (sign of self-neglect) and his critical view of himself as the creator of the problems with his friends, and the view of others as detached and unaccepting of his views, he is constantly on edge. this takes him to behave towards others aggressively, in a controlling way, and even hit others so they listen. The adaptive self state is centered around the writer's wish for relatedness exhibited in his cry for help from the forum. the act of sharing follows his need to vent, and is a sign of self-care behavior by the writer. additionally, the writer feels emotional pain following sharing his needs and condition with his best friend, and views himself in a sign of self acceptance as a logical, funny and straightforward person.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "A": {
            "Category": "(3) Sad, emotional pain, grieving",
            "highlighted_evidence": "told him about how my life is crumbling and he didn’t even try to understand, the only way I got him to listen was assault, I’m beyond disappointed"
          },
          "B-S": {
            "Category": "(1) Self care and improvement",
            "highlighted_evidence": "I needed to vent,"
          },
          "B-O": {
            "Category": "(1) Relating behavior",
            "highlighted_evidence": "’ve told him about my adhd and anxiety and my persistent lack of sleep and how it’s ruining my life"
          },
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "I’m a highly logical straightforward person, but with an open sense of humor,"
          },
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "Serious, Seriously: Help"
          }
        },
        "maladaptive-state": {
          "A": {
            "Category": "(2) Anxious/ fearful/ tense",
            "highlighted_evidence": "I’m super stressed and devastated"
          },
          "B-S": {
            "Category": "(2) Self harm, neglect and avoidance",
            "highlighted_evidence": "my persistent lack of sleep"
          },
          "B-O": {
            "Category": "(4) Over controlled or controlling behavior",
            "highlighted_evidence": "only one time has one of them listened, it was when I slapped him hard and told him to shut the fuck up and listen,"
          },
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "me and my small group of friends are on a tight rope because of my shit I do"
          },
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "when I share my opinion all of my friends have drastically different views and often make fun of me and disrespect me for my logical viewpoint (and that I live in a highly democratic state and I’m a bit of a republican but enough politics for now) and since I’m republican I don’t want them to know in case they turn me into a social outcast because they are all super democratic people, my anxiety takes over and it starts with thoughts like “what if they know (insert highly secretive secret I’ve been hiding that could ruin my entire reputation in the school and ruin my friendship with all at this school)"
          },
          "D": {
            "Category": "(6) Expectation that competence needs will not be met",
            "highlighted_evidence": "I can’t do this shit anymore, I’m going to snap soon from this stress and stuff,"
          }
        }
      }
    },
    {
      "post_index": 15,
      "post_id": "9ff6d8abf2",
      "date": "30-12-2019, 17:01:33",
      "post": "Do you guys ever get this?\nMe:doing whatever  Anxiety:something bad is gonna happen Adhd:agreed Me:what is gonna happen? Anxiety: Idk lol but something is",
      "Post Summary": "The dominant self state in the post is more dominant, and is composed to a very self-critical voice ridiculing the way his anxiety and adhd take over. the adaptive self state is composed of a wish for relatedness presented to the forum, a wish to feel as if he is not alone with the way he experiences anxiety.",
      "Well-being": 6,
      "evidence": {
        "adaptive-state": {
          "D": {
            "Category": "(1) Relatedness",
            "highlighted_evidence": "Do you guys ever get this?"
          }
        },
        "maladaptive-state": {
          "C-S": {
            "Category": "(2) Self criticism",
            "highlighted_evidence": "Me:doing whatever  Anxiety:something bad is gonna happen Adhd:agreed Me:what is gonna happen? Anxiety: Idk lol but something is"
          }
        }
      }
    },
    {
      "post_index": 16,
      "post_id": "bf5c346d3c",
      "date": "30-12-2019, 21:11:19",
      "post": "My power is immeasurable\nI can eye shake and ear rumble, at the same time, and control how powerful they are individually",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 17,
      "post_id": "7ccc984edd",
      "date": "05-01-2020, 23:12:32",
      "post": "Thank you for the gold kind stranger\nWowee! Thanks for 4 upvotes mom and dad and step mom and step dad!  Update: thanks for gold kind stranger Update wowee I got an award on Reddit I am so cool I am going to aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 18,
      "post_id": "fd4e28b502",
      "date": "19-01-2020, 01:34:54",
      "post": "Stereotypes\nQuick list of retarded stereotypes    Not all Mental illness/disorder sufferers are doing it for attention  Not All men are rapey, with sex on their mind all the time   All women are not your fucking plaything, you are a man, learn how to be one   You cannot turn off a mental illness or disorder   Self harm is not for attention   Not all black people are “ghetto”   Not all white people are stingy assholes  Not all Koreans are Kim Jong Un  Gamers are not hermits, we go outside, we aren’t 500 pounds either   _____________________________________  Fun facts:   The world isn’t shit  The world isn’t perfect   Nobody is perfect   Nobody will ever be perfect  Most discord admins are furries, but more importantly biased   No one fucking cares about your political opinion   No one fucking cares about your orientation, if I went out and screamed I’m straight to everyone, no one would care and I’d probably be slapped, but if you tell everyone that you’re (insert) and that you’re special, reality’s here and they say, you’re not special, you are just  another ant in the colony of human civilization   Liking dark humor doesn’t make you an asshole  Playing violent video games doesn’t make you violent  Removing posts you don’t agree with instead of rule violating posts is censorship, and really scummy  Thank you for listening and if you’re the type to PUT ANOTHER GOD DAMN BTS GIF UNDER A TWEET, GO FUCK YOURSELF, GEE WIZ THAT WAS SO FUCKING COOL YOU LIKE THIS BAND MEMBER, WOW NOW STFU",
      "Post Summary": "The dominant self state in the post is maladaptive and it is composed to the writers feeling others are detached and think terrible things about himself and others, needing to clarify his position and refute stereotypes about himself. the adaptive self state is composed of the writer weaving self accepting sentences inside the post, like nobody is perfect and nobody will ever be perfect.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {
          "C-S": {
            "Category": "(1) Self-acceptance and compassion",
            "highlighted_evidence": "Nobody is perfect   Nobody will ever be perfect"
          }
        },
        "maladaptive-state": {
          "C-O": {
            "Category": "(2) Perception of the other as detached or over attached",
            "highlighted_evidence": "Not all Mental illness/disorder sufferers are doing it for attention  Not All men are rapey, with sex on their mind all the time"
          }
        }
      }
    },
    {
      "post_index": 19,
      "post_id": "84da10b981",
      "date": "24-01-2020, 01:42:05",
      "post": "Shitty names\nOkay here are some shitty names in my opinion:  Key word my fucking opinion so if you’re name is listed please don’t whine in the comments “boohoo me downvote you1!!1!1!1”   Ok to start:  Cooper is a fucking dog name  Cleo sounds like my grandmother sneezing  Daniella is just ew  Precious, angel, or any other gross ass names are setting up your kid up for constant harassment   Mason is the best name, silence you shitty named peasants  Sara without an h is just no  Female mason as mayson, stop Named after states or cities Flower names  And finally, Jonah sounds like a retard trying to donut",
      "Post Summary": null,
      "Well-being": null,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {}
      }
    },
    {
      "post_index": 20,
      "post_id": "f446481601",
      "date": "28-01-2020, 09:03:01",
      "post": "Man spreading\nHello, man spreading is totally fine, to all you girls out there complaining about it, where the fuck do you want us to put it?",
      "Post Summary": "The self state in the post is maladaptive and is centered around the perception that females are opposing him, with an unfair request to not manspread that blocks his autonomy. therefore he acts in a critical way towards the others, by writing this post.",
      "Well-being": 7,
      "evidence": {
        "adaptive-state": {},
        "maladaptive-state": {
          "B-O": {
            "Category": "(2) Fight or flight behavior",
            "highlighted_evidence": "to all you girls out there complaining about it, where the fuck do you want us to put it?"
          },
          "C-O": {
            "Category": "(4) Perception of the other as blocking autonomy needs",
            "highlighted_evidence": "Man spreading\nHello, man spreading is totally fine, to all you girls out there complaining about it, where the fuck do you want us to put it?"
          }
        }
      }
    }
  ],
  "timeline_summary": "The writer's self states most of the timeline were vague, with somewhat to moderate presence. When his anxious affect appears, the dominance of the maladaptive self state is sure to become increasingly dominant. that being said, it's important to know that the maladaptive self states dominated through most of the timeline, with some posts showcasing solely maladaptive self states. towards the end of the timeline, the elements of the self states turned outwards, with cognitions and behavior towards others becoming more dominant."
}